{
	"name": "DepositAccountAgreement",
	"properties": {
		"Name": "DepositAccountAgreement",
		"EntityType": "TABLE",
		"TableType": "EXTERNAL",
		"Namespace": {
			"SchemaName": null,
			"DatabaseName": "ConsumerGoods_vfz",
			"DatabaseId": null
		},
		"StorageDescriptor": {
			"Distribution": null,
			"Columns": [
				{
					"Name": "ContractId",
					"Description": "The unique identifier of a Contract.",
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Length": 0,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "ContractId"
					}
				},
				{
					"Name": "AccountOwnershipStatement",
					"Description": "Ex:\n\nAccount Ownership\nYou may open an account in your name alone, or with one or more parties. The following is a brief summary of the general forms of account ownership available. \nNOTE: Because decisions concerning whether an account should be held in a particular capacity may have significant legal, tax and estate planning consequences, consultation with your attorney or tax advisor is recommended. \nIndividual Account - Owned in the name of one person. \nJoint Account - All funds held in joint accounts are the property of the person(s) named on the Signature Card and all owners have an equal and undivided ownership interest in the whole account during their lifetimes. All joint accounts at \"bank name\" are joint accounts with right of survivorship; therefore, on the death of one party named on the account, all sums in the account vest in and belong to the surviving party(ies) as his/her own separate property. We will not recognize any claims of the deceased depositor's estate or any provisions of the deceased depositor's will. Payment of funds in the account to the surviving party(ies) constitutes a full release and discharge of us. It is the owner's sole responsibility to determine the legal effects of opening an account of this nature. \nCalifornia Uniform Transfers To Minors Act Account (CUTMA) - The transferor of the CUTMA funds and the CUTMA account custodian understand and agree that upon creation of the account, the funds in the account, including any additions thereto and interest accruing thereon, are transferred, irrevocably, to the minor beneficiary of the account. The CUTMA account must be maintained by the custodian pursuant to the provisions of the California Uniform Transfers to Minors Act. The custodian has the sole authority to transact business on the account. Each CUTMA account may have only one custodian and one minor beneficiary. If the custodian resigns, is removed or dies, we will recognize the designated successor custodian or guardian of the minor if no successor custodian of the CUTMA is initially named. \nSole Proprietorship - As a sole proprietorship account, you warrant, as an individual, that you are the sole owner of your business. If you operate under a fictitious business name, your account will be opened in your individual name doing business as your fictitious business name, and we will require you to furnish a copy of a filed fictitious business name statement and proof of required publication. \nFictitious Business Name - If the name in which the account is held is fictitious, a copy of a filed fictitious business name statement and proof of publication will be required. Each account holder represents that one or more of the accountholders has the right to use that name and have fulfilled all legal requirements for using and/or doing business under that name. \nCorporation/Non-Profit Organization - A corporation is a business operating for profit or not for profit pursuant to articles of incorporation and by-laws and chartered under the laws of a state or foreign country. A corporation may be required to submit copies of appropriate corporate documents as proof of existence and that the designated signers are authorized to act on behalf of the corporation. We may require a corporation to submit additional corporate documents as support for any request to change the authorized signers on the account. \nLimited Liability Companies - A limited liability company or domestic limited liability company means an entity having one or more members that is organized under Title 2.5 of the California Corporations Code, or a limited liability company organized under other similar applicable state law. \nUnincorporated Associations - An informal association of individuals or other business entities. To open an account in the name of an unincorporated association, we may require the association to submit documents demonstrating the existence of the association and the authority of the designated individuals to act on behalf of the association and any necessary fictitious business name documentation. \nPartnership Account - This is an association of two or more persons to carry on as co-owners of a business for profit. In order to open a partnership account, we will require all general partners to sign the signature card creating the account. The partners signing to create the account warrant that they are all the general partners of the partnership or, if less than all the general partners, they are authorized to act on behalf of the partnership in opening the account and designating signers on the account. At our discretion, we may require the partnership to submit copies of selected partnership documents demonstrating existence of the partnership and the authority of the designated signers to open the account and transact business on the account and any necessary fictitious name documentation. We will require a partnership to submit additional partnership documents as support for any request to change the authorized signers on the account. \nLimited Partnership - Means a partnership formed by two or more persons with one or more general partners and one or more limited partners, or their equivalents under any name. \nFiduciary - An account opened under court authorization by executors, administrators, conservators, guardians, or by trustees under written trust agreements. The Bank may require that a certified copy of the court order or trust agreement be provided to the Bank, verifying that the person opening the account is a designated fiduciary, the powers of the fiduciary, provisions for succession, and other specific provisions. \nPay On Death Account with Single Party - This account is owned by the named party. Upon the death of that party, ownership passes to the named pay-on-death payee(s). \nPay On Death with Multiple Parties - This account is owned by the named parties. Upon the death of any one of them, ownership passes to the survivor(s). Upon the death of all of them, ownership passes to the named pay-on-death payee(s).",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "AccountOwnershipStatement"
					}
				},
				{
					"Name": "AuthorizedSignersStatement",
					"Description": "Ex:\n\nAuthorized Signers\nThe following terms apply to individual accounts and those with more than one signer: \n\" We may endorse checks for you that we receive for deposit. \n\" We may transfer funds between your accounts, transfer your accounts, and take other actions per the written instructions of any signer subject to any signature requirement on the account. \n\" We may rely on the information that you give us and we enter into our records, until you notify us in writing of a change. \n\" If we believe there is a dispute about ownership or control of the account, we may place a hold on the funds and not release the funds until we receive either a court order or instructions signed by all persons claiming interest in the account. \n\" We may deduct amounts you owe us, such as fees and charges, from your account. \nThe following terms apply only to accounts with more than one signer: \n\" We may require the signatures of all signers if there are any conflicts among you. \n\" We may cash or deposit all checks payable to any signer when endorsed by any other signer. \n\" Each signer is individually liable for debts owed to \"bank name \"on an account, regardless of which signer incurred the debt.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "AuthorizedSignersStatement"
					}
				},
				{
					"Name": "AccountVerificationServicesStatement",
					"Description": "Ex:\n\nAccount Verification Services\nNew and existing accounts are subject to verification through ChexSystems and may be declined based on adverse information. All parties to an account are subject to verification. Should you be denied the opportunity to open or sign on an account because of negative information, you may request, in writing, a file copy through 'system name'.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "AccountVerificationServicesStatement"
					}
				},
				{
					"Name": "AdjustmentsStatement",
					"Description": "Ex:\n\nWe may make adjustments to your account from time to time. This may be due to the return of a check that you deposited which was unpaid or a deposit posted in the wrong amount.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "AdjustmentsStatement"
					}
				},
				{
					"Name": "BusinessDaysStatement",
					"Description": "Ex:\n\nMonday through Friday, 9:00 a.m. to 4:30 p.m., are business days. If you make a deposit after the close of business, or on Saturday, Sunday, or holidays, the day of deposit will be the next business day. Refer to the Regulatory Disclosure regarding ATM and foreign ATM deposits.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "BusinessDaysStatement"
					}
				},
				{
					"Name": "CashTransactionStatement",
					"Description": "Ex:\n\nPursuant to Federal law and regulations, we are required to report large domestic transactions in cash or coin to the Treasury. We are also required to maintain records on certain purchases of monetary instruments.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "CashTransactionStatement"
					}
				},
				{
					"Name": "CashiersChecksStatement",
					"Description": "Ex:\n\nYou do not automatically have the right to stop payments on Cashier's Checks you purchase from us. In the event that a Cashier's Check is lost, stolen, or destroyed, please contact us as soon as possible for the procedures to follow to obtain reimbursement or have the Cashier's Check reissued. In general, you will have to complete and sign, under penalty of perjury, a declaration of loss. The declaration of loss should describe the cashier's check and how it came to be lost, stolen, or destroyed. We may then wait ninety (90) days from the date the check was issued before we pay your claim. If ninety (90) days has already passed, then we will act on your claim within a reasonable time. If the check is presented during the ninety (90) day waiting period, we may pay the item to a person entitled to enforce the check. If this happens, we will not pay your claim.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "CashiersChecksStatement"
					}
				},
				{
					"Name": "ChangeInOwnershipStatement",
					"Description": "Ex:\n\nAll of the Bank's accounts are non-negotiable and non-transferable except upon the books of the Bank. The ownership of an account may not be changed except upon any required signature authority. Where ownership of an account is changed, \"bank name\" will close the existing account and open a new account in the name of the new accountholder.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "ChangeInOwnershipStatement"
					}
				},
				{
					"Name": "ChangeOfAddressStatement",
					"Description": "Ex:\n\nYou agree to notify us in writing or in person in the event that you change your mailing address. You authorize us to obtain your current residence address from the Department of Motor Vehicles and waive your rights under California Vehicle Code Section 1808.21 or any other similar applicable state law.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "ChangeOfAddressStatement"
					}
				},
				{
					"Name": "ChangeInTermsStatement",
					"Description": "Ex:\n\nThe Bank may change the terms and conditions governing your account at any time by giving you written notice thereof. We will give you advance notice of any such change when required by applicable law. If you maintain your account or permit your certificate account to renew upon maturity after the effective date for the change, you agree to the change.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "ChangeInTermsStatement"
					}
				},
				{
					"Name": "CheckPrintingAndCheckOrderingStatement",
					"Description": "Ex:\n\nIf you order checks through us, you will be charged for the check printing. The amount varies depending on the style and quantity of checks you order. \n\nIf you order checks directly from an outside check printer or use computer generated checks, they must be printed using a standard format that can be read and processed by our equipment. If the checks ordered from non-Bank authorized check printers are considered \"unreadable,\" we may charge you a special processing fee and/or require that you obtain serviceable checks. You agree not to use any checks that contain a background image that interferes with our or any other Bank's ability to produce a digital image of your check. If you do, you will be responsible for any losses you or another person suffers because of the inability to produce a readable check. You further agree to use checks that contain certain high security features such as a real watermark, thermochromatic ink, and paper that is sensitive to at least 15 chemicals. If you choose to use checks that do not contain these security features, you will be responsible for any losses you or another person suffer due to a criminally altered or replicated check. \n\nYou agree not to print special limitations on checks, withdrawal orders or other items drawn on your account, such as \"void over $100\" or \"paid in full\" or \"void after ninety (90) days.\" If you do print any special limitations, you agree that we are not bound by such limitations and you authorize us to pay such items without regard to the limitation(s). \n\nYou are responsible for checking the accuracy of all information shown on your checks whether ordered through us or third parties. We are not liable for losses resulting from incorrectly printed checks.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "CheckPrintingAndCheckOrderingStatement"
					}
				},
				{
					"Name": "CheckEndorsementStandardsStatement",
					"Description": "Ex:\n\nGovernment regulations specify both how you endorse checks that you ask us to cash or deposit, and what you may place or have preprinted on the back of checks. \n\" The top 1 1/2 inches of the back of the check is the area designated for your endorsement as payee. \n\" The center portion of the check is reserved for bank use. \n\" The remainder of the check is used for subsequent bank endorsements. \nIf you endorse a check in the area reserved for bank use, or your endorsement is illegible, you are liable for checks that are returned late or unpaid. \n\nGovernment, insurance, and title company checks must have the personal endorsement of all payees. You authorize us to accept transfers, checks and other items for deposit to your account if they are made payable to, or to the order of, any one or more of you, whether or not they are endorsed by you. You authorize us to supply missing endorsements, and you warrant that all endorsements are genuine.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "CheckEndorsementStandardsStatement"
					}
				},
				{
					"Name": "CheckSafekeepingStatement",
					"Description": "Ex:\n\nWe may retain the original checks written on your checking account and not return them in your monthly statement. We will include information about the check number, amount, and date the checks were paid on your monthly statement. You may request up to two (2) copies of checks free of charge for each monthly statement we send you.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "CheckSafekeepingStatement"
					}
				},
				{
					"Name": "ClosingOrSuspendingAccountsStatement",
					"Description": "Ex:\n\nWe may honor any authorized signer's request to close or suspend an account subject to any specific account signature requirements. At our discretion, we may require the signatures of all accountholders and/or authorized signers before permitting the withdrawal of funds or the closing or suspension of an account. We may return checks or other items, marked \"Refer to Maker\" or similar language, in the event there is a dispute over the ownership or control of an account. \n\nWe may close your account at any time, with or without cause, and remit the balance to you at the last address we have on file for you. You may close your account at any time upon notice to us, subject to any applicable early withdrawal penalty and/or any specific signature requirements. You will remain liable for the payment of accrued fees on the account and for checks in the collection process. If your account has been open for less than twelve (12) months, you may be subject to an early closure fee. Refer to the current Schedule of Fees and Charges. \n\nIf you or we have reason to believe your account has been compromised, we may close your account at our discretion.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "ClosingOrSuspendingAccountsStatement"
					}
				},
				{
					"Name": "DeathOrIncompetencyStatement",
					"Description": "Ex:\n\nYou agree to notify the Bank promptly if any owner or authorized signer on your account dies or is declared incompetent by a court of appropriate jurisdiction. We may place a hold on an account and refuse to accept deposits or requests for withdrawal upon receipt of notice that the owner or signer has died or has been declared incompetent by a court of appropriate jurisdiction. We will not release funds to a successor, or to a representative of a deceased owner's estate, or to a conservator for an owner except upon submission of documentation demonstrating the death or incompetence of the customer and the authority of the representative, successor, or conservator to take possession or delivery of the funds. Where a non-owner signer on an account dies or is declared incompetent, our general rules regarding changing signers on accounts will apply. Until the Bank has received written notice of the death or incompetence of any account signer, it may rely and act upon the signature of such deceased signer. We may suspend, refuse, and reverse any transactions or deposits (for example, automatic Federal direct deposits of benefit payments belonging to the decedent) if any owner or authorized signer dies or is declared by a court to be incompetent. \n\nUpon the death of an accountholder, the manner in which we release the account or any interest in the account will depend on the vesting of the account, the size of the estate, and/or the state of residence at the time of death. To determine how the account or your interest in an account must be released upon your death, we may require your successor or personal representative to submit a certified copy of your death certificate and any other documents we deem necessary, at our sole discretion, to establish who is entitled to delivery of your account or your share of the account.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "DeathOrIncompetencyStatement"
					}
				},
				{
					"Name": "DemandDraftsStatement",
					"Description": "Ex:\n\nIf you voluntarily give information about your account (such as our routing number and your account number) to a party who is seeking to sell you goods or services, and you don't physically deliver a check to the party, any debit to your account initiated by the party to whom you gave the information is deemed authorized.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "DemandDraftsStatement"
					}
				},
				{
					"Name": "DepositsStatement",
					"Description": "Ex:\n\nYou warrant that all endorsements on items deposited to your account are genuine. In the event you fail to endorse an item deposited to your account, you agree that we may supply your missing endorsement. You agree to reimburse us for any loss, cost, or expense we incur as a result of your failure to endorse an item exactly as drawn. If we received an affidavit stating that one or more endorsements on a check or other item deposited into your account is forged, we may freeze the amount or charge back the amount of the item to your account, without prior notice to you, even though you may have already used the funds. In the case of a certificate of deposit, the account will be closed. \n\nWe reserve the right to refuse to accept items for deposit that bear more than one endorsement or the endorsement of individuals who are not known to us. If you wish to deposit an item that has been previously endorsed by one or more individuals, we reserve the right to require all endorsers to be present before we accept the item or that their endorsements be guaranteed by their financial institutions. \n\nAny credit to an account is subject to final verification, payment, and adjustment by us. We are obligated only to use ordinary care in collecting items on your behalf. We shall not be liable for the negligence of other banks in the collection of checks and other items. If we give provisional credit for an item, we reserve the right to charge back the amount of the item if we do not receive final payment. \n\nUnless you have instructed us to the contrary, we reserve the right, but are not required, to send a returned deposited item back for payment a second time before notifying you. At our option, this resending may be done electronically. Returned deposited items may incur charges to your account. Refer to the current Schedule of Fees and Charges. \n\nIf, in connection with a direct deposit plan, we deposit any amount in an account which should have been returned to the Federal government for any reason, you authorize us to deduct the amount of the liability to the Federal government from the account or from any other account you have with us, without prior notice and at any time, except as prohibited by law. We may also use any other legal remedy to recover the amount of the liability.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "DepositsStatement"
					}
				},
				{
					"Name": "DepositsOfForeignCurrencyInstrumentsStatement",
					"Description": "Ex:\n\nThe Bank may refuse to accept for deposit or collection items that are payable in currency other than U.S. dollars (a \"foreign currency instrument\"). We handle such items as \"collection items,\" meaning that we send the item to the issuer's bank for payment. When the Bank receives the payment, we will credit your account. If the item is returned unpaid, we will return the item to you. The bank has sole discretion in determining whether to accept an item for deposit or collection. If the Bank accepts any such instrument for deposit or collection, you have all the risk associated with foreign currency exchange rates. Foreign currency instruments drawn on foreign banks may be returned unpaid later than instruments drawn on U.S. banks. You have the risk of late return. The Bank reserves the right to place longer holds on foreign currency instruments than the timeframes specified in the Bank's funds availability policy for domestic items.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "DepositsOfForeignCurrencyInstrumentsStatement"
					}
				},
				{
					"Name": "DormantOrInactiveAccountsStatement",
					"Description": "Ex:\n\nAn account on which there has been no activity for a period of time as provided by applicable state or Federal law may be considered inactive. Activity on an account includes, but is not limited to, transactions such as withdrawals and deposits, or account inquiries. An account may become dormant when no activity has occurred over an extended period of time. Applicable state law may require that the Bank remit or escheat the account balance to the state pursuant to applicable unclaimed property laws. \n\nMaintenance Fees and other applicable account fees and charges for dormant accounts will remain the same as they were when the account was active. Charges are not reimbursed for dormant accounts that are later reclassified as active. We may change the Schedule of Fees and Charges for dormant accounts. \n\nWe will try to notify you before we classify the account as dormant by sending a notice to the address we currently show on our records. We will hold all statements on your dormant account if we cannot contact you.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "DormantOrInactiveAccountsStatement"
					}
				},
				{
					"Name": "EarlyWithdrawalPenaltiesStatement",
					"Description": "Describes the penalties that will be imposed should the account holder decide to make premature withdrawals.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "EarlyWithdrawalPenaltiesStatement"
					}
				},
				{
					"Name": "FacsimileSignaturesStatement",
					"Description": "Ex:\n\nYou agree to obtain approval from us prior to using a facsimile signature for your accounts. If approved, you authorize us to honor all checks or other orders drawn on your account containing a facsimile signature, including those drawn to the individual order of any person whose name appears as facsimile signer. We may charge your account for all such checks or other orders, regardless of the circumstances under which the facsimile signature may have been used, if such signature resembles the specimen filed by you with us.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "FacsimileSignaturesStatement"
					}
				},
				{
					"Name": "GoverningLawStatement",
					"Description": "Ex:\n\nExcept as provided by conflicting Federal law or regulation, accounts shall be governed by the state laws applicable to the branch location where your account was established.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "GoverningLawStatement"
					}
				},
				{
					"Name": "AccountHandlingStatement",
					"Description": "Ex:\n\nWe will process and pay your checks in accordance with reasonable banking standards. Our automated processing of checks, an industry-wide practice by which not all maker signatures are examined, will be considered to comply with reasonable banking standards. \n\nYou agree to maintain your unused and cancelled checks in a secure area and to properly guard against improper access to them. You further agree that you will not entrust the writing of checks and reconcilement/review of your account statement to the same person without your frequent monitoring. We reserve the right to deny a claim for monetary loss due to forged, altered, or unauthorized checks if you fail to follow these procedures. We agree to exercise ordinary care in paying items against your account. \n\nWe may continue to honor your instructions until we receive written notice of any changes from you and have had a reasonable opportunity to act. You authorize us to pay items signed by formerly authorized signers for a reasonable period of time after we receive your notice of changes as to your authorized signers. Refer questions about this Agreement to your branch of account.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "AccountHandlingStatement"
					}
				},
				{
					"Name": "IdentificationRequirementsStatement",
					"Description": "Ex:\n\nTo open an account at the Bank, you will need one current form of acceptable identification. Provisions of the Bank Secrecy Act and IRS code require that we obtain an appropriate Social Security number or taxpayer identification number (TIN). Deposit accounts for fiduciaries, partnerships, limited liability entities, corporations, and fictitious business names will also need to provide the Bank with valid documentation of existence, such as articles of incorporation, court orders, partnership agreements, fictitious business name statements, and/or any other documents that the Bank deems necessary. Please refer to the Customer Identification Program section in the Regulatory Disclosure.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "IdentificationRequirementsStatement"
					}
				},
				{
					"Name": "InternetLiabilityStatement",
					"Description": "Ex:\n\nWe maintain an Internet website for transactional activities and to provide information regarding our products and services and other bank related information. If you submit information to us over the Internet via email, please be advised that the information you send to us is not secure or confidential and may be observed by third parties while in transit to us. We cannot act on instructions sent to us from an external email address. We will not be liable to you for any damages you may sustain arising from the observation by any third party of confidential information you send via email to us over the Internet. Check with your Internet Service Provider or refer to your browser \"Help File\" for more details about Internet security.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "InternetLiabilityStatement"
					}
				},
				{
					"Name": "LegalProcessStatement",
					"Description": "Ex:\n\nIf we are served with any legal process relating to your account (for example, subpoena, restraining order, writ, etc.), we must comply as required by law. We will attempt to notify you of such action in writing at the last address we have in our records for you unless we are prohibited by law or court order from doing so. If we receive legal process that affects your account, we will charge a processing fee to your account unless otherwise provided by law. We may accept service of an IRS Notice of Levy or a release of such a levy by facsimile transmission. \n\nAny garnishment or levy against your account is subject to our right of setoff against the account. In the event that a garnishment or levy reduces the account balance to a level insufficient to pay items presented for payment against the account, we are not liable for dishonoring the items. When an IRS Levy is received prior to 11:00 a.m. and the balance of the account(s) affected is not sufficient to satisfy the Levy, all checks that were paid the night before (excluding \"on-us checks\" payable to bank or cashed at bank) will be reversed and returned",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "LegalProcessStatement"
					}
				},
				{
					"Name": "LiabilityStatement",
					"Description": "Ex:\n\nYou agree to the terms of this account and the Schedule of Fees and Charges. You authorize us to deduct these charges directly from the account balance. You will pay any additional reasonable charges for services you request that are not covered by this agreement. \n\nEach of you also agrees to be individually, jointly and severally liable for any account shortage resulting from charges or overdrafts, whether caused by you or another person with access to this account. This liability is due immediately, and can be deducted directly from your account balance whenever sufficient funds are available. You have no right to defer payment of this liability, and you are liable regardless of whether you signed the item or benefited from the charge or overdraft. This includes liability for our costs to collect the deficit to the extent permitted by law, including our reasonable attorney's fees.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "LiabilityStatement"
					}
				},
				{
					"Name": "LostItemsStatement",
					"Description": "Ex:\n\nWe act only as a collection agent for you when we receive a check for deposit or which we cash for you. If that check or other item is lost, stolen, or destroyed in the process of collection, we may reverse the credit for any deposit or charge your account for the cashed check or item.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "LostItemsStatement"
					}
				},
				{
					"Name": "NoticeOfWithdrawalStatement",
					"Description": "Ex:\n\nFederal regulations require the Bank to reserve the right to require seven (7) days prior written notice for any withdrawal from Savings, Interest Checking, and Money Market accounts.  While the Bank must reserve this right, it is not our general policy to exercise it.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "NoticeOfWithdrawalStatement"
					}
				},
				{
					"Name": "NoticesRegardingAnAccountStatement",
					"Description": "Ex:\n\nWe may send statements and notices to any party on an account by mailing or delivering a notice to the last address we have on file for the account. Notice to any accountholder or authorized representative shall be deemed to be notice to all accountholders. We generally mail the notice before the effective date of the change. \nIf we hold statements or notices relating to the account at your request, or because you fail to give us a current address for the account, the notices are deemed delivered to you upon receipt or preparation by the office of the account. Any notice or statement returned to us as undeliverable shall be deemed delivered to you as of the date it is deposited by us in the mail. \nYou must deliver to us, during normal banking hours, all notices that are requested by this Agreement or by law at the office that holds your account or any other address we specify. If you have multiple accounts or services, you may have to send notices to more than one office.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "NoticesRegardingAnAccountStatement"
					}
				},
				{
					"Name": "OtherAgreementsStatement",
					"Description": "Ex:\n\nYou may have another agreement with us which, by its terms, supersedes this Agreement in whole or in part. For example, if you are a business customer, certain provisions of your other agreements (such as an Account Analysis Agreement or Night Depository Agreement) may supersede some of the terms of this Agreement, to the extent that they are inconsistent. If you are a consumer, your accounts may also be governed in part by one or more electronic fund transfer agreements.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "OtherAgreementsStatement"
					}
				},
				{
					"Name": "OverdraftAndReturnedChecksStatement",
					"Description": "Ex:\n\nIf there are insufficient funds available in your account to pay a check or transaction, it may be returned unpaid. However, we may, at our sole discretion, create an overdraft by paying the check or item or by permitting the transaction. In either case, there will be a service charge for each non-sufficient funds (NSF) item and/or transaction and/or continuous daily overdrafts.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "OverdraftAndReturnedChecksStatement"
					}
				},
				{
					"Name": "PostdatedChecksStatement",
					"Description": "Ex:\n\nWe may charge your account for an item that is otherwise properly payable from the account even though we pay the check before the date on it, unless you give us special \"notice of postdated check.\" You can give this special notice to us orally, but it must be received by us in order to give us a reasonable opportunity to act before the final payment of the item. In placing your notice of postdated check, you must describe the check by giving the date, the check number, the exact amount of the check, and the name of the payee in order for us to return the item if it is presented for payment before the date on the check. We require that you put your notice of postdated check in writing to us within fourteen (14) days. We have a special form for this purpose. If you do not put your notice in writing, then your notice of postdated check will expire at the end of the fourteen (14) day period. If you put your notice in writing to us, then your notice of postdated check will remain in effect until the date of the check. We impose a fee for each notice of postdated check.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "PostdatedChecksStatement"
					}
				},
				{
					"Name": "PowerOfAttorneyStatement",
					"Description": "Ex:\n\nThe Bank can provide you with a power of attorney form for your use in appointing a person or persons to sign on your account, and sign and endorse checks or other items, on your behalf, as your agent. You are bound by, and responsible for, the actions of your agent. \nThe Bank may recognize an agent appointed by you on a power of attorney document other than that supplied by us. If you do not use one of our power of attorney forms, bank may refuse to honor that power of attorney. However, in most cases, we will accept the Uniform Statutory Form Power of Attorney as set forth in the California Civil Code, subject to approval by the Bank's counsel. We may require a separate form for each account for which you want to grant power of attorney. \nThe Bank may refuse to honor a power of attorney if the power of attorney is not properly notarized when presented or is otherwise irregular.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "PowerOfAttorneyStatement"
					}
				},
				{
					"Name": "BankReservationOfRightsStatement",
					"Description": "Ex:\n\nReservation of Rights \n\"bank name\" reserves the right to: \n\"Refuse to open any account, or to service or to accept additional deposits to an existing account; \n\"Limit the principal balance of any account; and \n\"Close an account at any time.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "BankReservationOfRightsStatement"
					}
				},
				{
					"Name": "ResolvingDisputesOrControversiesStatement",
					"Description": "Ex:\n\nWe try to resolve our customers' problems or disputes as quickly as possible. In most cases, we can resolve a problem in a branch or by telephone. Any dispute or controversy regarding your deposit account relationship will be decided by either arbitration or referee. Under the procedures, the dispute is submitted to a neutral person for determination in place of trial before a judge or jury. A dispute or controversy involving one deposit account relationship, or two or more deposit account relationships with at least one common owner, is decided by arbitration under the Commercial Arbitration Rules of the American Arbitration Association. Any other dispute or controversy is decided by reference under California Code or Civil Procedure Section 638 and related sections or any other similar governing state law. A referee, either an active attorney or a retired judge, is selected according to the procedures by selecting arbiters of the American Arbitration Association and is then appointed by the court in which the action regarding the dispute or controversy is pending. \nIn the event there is a dispute over the ownership or control of an account, the Bank, at its option, may return items and refuse to accept further deposits until all parties to the account agree in writing as to the resolution of the dispute. In the event that the dispute is not resolved within a reasonable time, the Bank, at its option may either (1) close the account and deliver a cashier's check for any remaining balance to the last address on file with us, or (2) it may tender the proceeds of the account into court, all without liability.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "ResolvingDisputesOrControversiesStatement"
					}
				},
				{
					"Name": "ReturnedItemsStatement",
					"Description": "Ex:\n\nIf a check or other item that we cash for you or which you deposit to your account is returned to us as unpaid for any reason, we may charge your account for the amount of the check or other item plus a Returned Deposited Item fee. This may include, among other circumstances, checks that are returned because the maker of the check had insufficient funds in its account and checks that were paid originally and later returned to us accompanied by an affidavit which states that the endorsement is forged or unauthorized or that the item has been altered in any way. We may charge your account for the amount without questioning the truth of such an affidavit. \nWe may, at our option, notify you by telephone if an item has been returned unpaid. If you authorize us to redeposit the item on your behalf, you waive any right to receive a written notice of the returned item and you authorize us to charge back the item to your account if it is returned unpaid again for any reason. Refer to the Schedule of Fees and Charges for information on Returned Deposited Item fees.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "ReturnedItemsStatement"
					}
				},
				{
					"Name": "RightOfSetoffStatement",
					"Description": "Ex:\n\nThe law provides that we may, in certain circumstances, take funds on deposit in your account to satisfy a debt you owe us. This is called the right of setoff. If we exercise this right of setoff, we shall comply with all applicable laws and regulations and we will notify you promptly of the action taken. All sums in a deposit account are subject to our right of setoff for liabilities owed to us by any or all of the accountholders, to the fullest extent permitted by law. \nIf we exercise our right of setoff against an account that is subject to an early withdrawal penalty, the account will be assessed the applicable early withdrawal penalty. \"bank name\" may recover funds you owe us from any of your deposit accounts.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "RightOfSetoffStatement"
					}
				},
				{
					"Name": "SeverabilityStatement",
					"Description": "Ex:\n\nIf any of the provisions of this Agreement are determined to be void or unenforceable, the remainder of this Disclosure shall remain in full force and effect.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "SeverabilityStatement"
					}
				},
				{
					"Name": "SignatureVerificationPolicyStatement",
					"Description": "Ex:\n\nOur signature verification policy meets the standard of ordinary care. The number of required signatures for an account is noted on the account signature card. If there is no number noted on the signature card, then any one of the authorized signers may sign checks or withdrawal orders and give us instructions regarding the account. \nYou understand and agree that the method in which checks are paid makes it beyond the control of the Bank to guarantee that checks are paid in accordance with Depositor's special restrictions or requirements relating to authorized signatures noted on the signature card for that account. You represent that such restrictions are for the sole benefit of Depositor and intended only as an internal company policy and control. Depositor further stipulates that, as issuer of said checks, the control, monitoring, and enforcement of internal signature authority is the sole responsibility of Depositor. The Depositor therefore agrees to hold harmless and indemnify the Bank against any and all liability for the payment of items that do not conform to the Depositor's own restrictions or requirements relating to multiple or tiered signatures stated on the signature card and the face of checks. However, if there is a conflict, the Bank reserves the right to require all authorized signers to sign a check or withdrawal order. \nEven if the authorized signers on an account change, we may continue to honor checks, withdrawal orders, and other instructions by authorized signers until we are notified in writing. \nAll account holders on a joint account authorize the other account holders to endorse items made payable to the name of any person appearing on the Signature Card as an owner and deposit these endorsed items into the joint account. Each accountholder may transfer or withdraw the funds on deposit at any time, subject to the limitations set forth in the preceding paragraphs.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "SignatureVerificationPolicyStatement"
					}
				},
				{
					"Name": "StaleDatedChecksStatement",
					"Description": "Ex:\n\nUpon presentment of an item for payment more than six (6) months after its date, we may charge your account for the item; however, we are not obligated to do so. If you want to ensure that we do not pay a stale-dated item, you should place a stop payment order on the item.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "StaleDatedChecksStatement"
					}
				},
				{
					"Name": "StatementsStatement",
					"Description": "Ex:\n\nWith certain exceptions, we provide accountholders with statements listing account transactions. You agree to examine your statements as soon as you receive them. You assume full responsibility for monitoring and reviewing the activity of your account and the work of your employees, agents, and accountants. You agree to notify us immediately if you think there is an error or an unauthorized transaction shown on your statement. Unless you notify us promptly, we will assume the statement is correct. If we send you a statement or item which contains or discloses an unauthorized signature or an alteration, you must notify us promptly of that fact, but no later than thirty (30) days after we deliver the item or statement to you. If you delay in examining your records or in reporting a problem, the delay may affect our ability to resolve the problem and you may be liable for losses that occur as a result of the delay. We may refuse to reimburse you for subsequent unauthorized transactions by the same wrongdoer(s). If you find that your records and our records disagree, you must call your branch of account immediately during regular business hours. \nIf you claim a credit or refund because of a forgery, alteration, or any other unauthorized withdrawal, you agree to provide us with an affidavit containing whatever reasonable information we require concerning your account, the transaction, and circumstances surrounding your claim. \nSpecial procedures apply to claims involving substitute checks. Please see the section of this Agreement titled, \"Substitute Checks and Your Rights\" for more information. \nYou agree to exhaust your remedies against your bonding or insurance company before making a claim against us for forgeries, alterations, or unauthorized payment orders in which your employee has been involved. \nYou agree that we may take a reasonable period of time to investigate the facts and circumstances surrounding any claimed loss, and that we will have no obligation to provisionally re-credit your account during our investigations. Your statements and notices will be mailed to the last address we have on file for the account. \nYou assume full responsibility for notices, vouchers, checks, items, statements, and other documents which are lost, destroyed, or stolen while in the mail or in transit to or from you or a third party. You agree to promptly return any checks or other items to us which do not belong to you. If statements are returned to the Bank by the Postal Service as undeliverable, we will retain the statement for a period of sixty (60) days and then destroy the statements and their contents.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "StatementsStatement"
					}
				},
				{
					"Name": "StopPaymentOrdersStatement",
					"Description": "Ex:\n\nYou may place a written or oral stop payment order on checks written against an account with check access. Oral orders must be confirmed in writing within fourteen (14) calendar days. We will accept a renewal order request from any authorized signer on an account. We may charge a fee for each stop payment order. Please refer to the current Schedule of Fees and Charges. Stop payment orders remain in effect for six (6) months unless renewed. If the check is presented for payment after the order expires, the Bank assumes no responsibility and may pay the check. We will cancel a stop payment order at any time with written authorization. We will not be liable for paying a check on the day we accept the stop payment request or if the check is cashed while our data processing system is not operating. To be effective, a stop payment request must accurately identify the account number, the check number, date of the check, amount of the check, and the payee.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "StopPaymentOrdersStatement"
					}
				},
				{
					"Name": "SubstituteChecksAndYourRightsStatement",
					"Description": "Ex:\n\nWhat is a Substitute Check?\nTo expedite check processing, federal law permits banks to replace checks with \"substitute checks.\" These checks are similar in size to original checks with a slightly reduced image on the front and back of the original check. The front of an original check states: \"This is a legal copy of your check. You can use it the same way you would use the original check.\" You may use a substitute check as proof of payment just like the original check. \nSome or all of the checks that you receive back from us may be substitute checks. This section describes the rights you have when you receive substitute checks from us. The rights in this section do not apply to original checks or electronic debits to your account. However, you have rights under other law with respect to those transactions. \nWhat are my rights regarding substitute checks?\nIn certain cases, federal law provides a special procedure that allows you to request a refund for losses you suffer if a substitute check is posted to your account (for example, if you think we withdrew the wrong amount or that we withdrew money from your account more than once for the same check). The losses you may attempt to recover under this procedure may include the amount that was withdrawn from your account and fees that were charged as a result of the withdrawal (for example, Non-Sufficient Funds fees-see the Schedule of Fees and Charges for more information). \nThe amount of your refund under this procedure is limited to the amount of your loss or the amount of the substitute check, whichever is less. You are also entitled to interest on the amount of your refund if your account is an interest-bearing account. If your loss exceeds the amount of the substitute check, you may be able to recover additional amounts under other law. \nIf you use this procedure, you may receive up to $2,500.00 of your refund (plus interest if your account earns interest) within 10 business days after we receive your claim and the reminder of your refund (plus interest if your account earns interest) not later than 45 calendar days after we receive your claim. \nHow do I make a claim for a refund?\nIf you believe you have suffered a loss relating to a substitute check you received and that was posted to your account, please contact us in writing at: \"bank name and address\".  We may require that you submit your claim in writing within 14 days of oral notification. You must contact us within 40 calendar days of the date we mailed (or otherwise delivered by a means to which you agreed) the substitute check in question or the account statement showing that the substitute check was posted to your account, whichever is later. We will extend this time period if you were not able to make a timely claim because of extraordinary circumstances. \nYour claim must include the following: \n\" A description of why you have suffered a loss (for example, you think the amount withdrawn was incorrect); \n\" An estimate of the amount of your loss; \n\" An explanation of why the substitute check you received is insufficient to confirm you suffered a loss; and \n\" A copy of the substitute check and identifying information such as the check number, the name of the person to whom you wrote the check, the amount of the check, etc. \n\nOther Important Information About Substitute Checks\nUnless we specifically permit you to do so, you may not deposit any substitute check that has not previously been handled by a bank in the U.S. collections process. This means you cannot deposit a substitute check you create, or one that is created by another person, unless we enter into an agreement to do so. \nYou agree not to use any checks that contain a background image that interferes with our or any other bank's ability to produce a digital image of your check. If you do, you will be responsible for any losses you or another person suffers because of the inability to produce a readable digital image of your check. \nYou agree to use checks that include certain high security features, such as a real watermark, thermochromatic ink, and paper that is reactive to at least 15 chemicals. If you choose to use checks that do not contain these security features, you may be responsible for any losses you or another person suffer due to a criminally altered or replicated check.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "SubstituteChecksAndYourRightsStatement"
					}
				},
				{
					"Name": "TaxpayerInformationStatement",
					"Description": "Ex:\n\nThe Bank is required to report annually to accountholders, the Internal Revenue Service (IRS), and to any governing state tax agencies, the interest payments that total $10.00 or more during a calendar year on each of your accounts. \nAccordingly, when you open an account, \"bank name\" is required to obtain from each accountholder a valid Social Security number and/or TIN, and correct information regarding your backup withholding status. We are also required to report interest paid to a non-resident alien. When you sign the Signature Card for an account you certify that you have provided the correct Social Security number or TIN. \n\nIf you fail to furnish the Bank with your certified Social Security number or TIN, if the IRS notifies us that you gave us an incorrect number, or if you failed to report all your interest and dividends, the Bank may be required to withhold 30.5% of your interest and pay that withheld interest to the IRS. \nAccounts held by exempt foreign persons are generally exempt from taxpayer information reporting unless the Bank is required to provide backup withholding to the IRS. For accounts with more than one owner, all owners must qualify and certify their status as an exempt foreign person. \nIf you fail to furnish a correct TIN, you may be subject to a $50.00 IRS fine. If you make a false statement that has no reasonable basis and that results in no backup withholding, you may be subject to a $500.00 IRS penalty. If you deliberately give false information, you may be subject to criminal penalties.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "TaxpayerInformationStatement"
					}
				},
				{
					"Name": "TelephoneTransfersStatement",
					"Description": "Ex:\n\nThe bank will honor telephone requests for fund transfers between accounts held made by the same persons and under the same conditions generally applicable to withdrawals made in writing.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "TelephoneTransfersStatement"
					}
				},
				{
					"Name": "WaiversStatement",
					"Description": "Ex:\n\nWe may delay enforcing our rights under this Agreement without losing them. Any waiver by us shall not be deemed a waiver of other rights or of the same right at another time. You waive diligence, demand, presentment, protest, and notice of every kind, except as otherwise set forth in this Agreement.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "WaiversStatement"
					}
				},
				{
					"Name": "WithdrawalsStatement",
					"Description": "Ex:\n\nUnless clearly indicated otherwise on the account records, any of you, acting alone, who signs in the space designated for signatures on the Signature Card may withdraw or transfer all or any part of the account balance at any time. Each of you (until we receive written notice to the contrary) authorizes each other person signing the Signature Card to endorse any item payable to you or on your order for deposit to this account or any other transaction with us. We may charge your account for a check even though payment was made before the date on the check, unless we have received written notice of the postdating in time to have reasonable opportunity to act. \nWe may refuse to honor checks drawn on your account if they are directly presented to us by someone we cannot identify to our satisfaction. \nAt our option, we may also require non-customers to provide a fingerprint, endorsement guarantee, or other assurance or documentation in connection with the transaction. \nWe may refuse any withdrawal or transfer request which you attempt on forms not approved by us, by any method we do not specifically permit, which is greater in number than the frequency permitted, or which is for an amount greater or less than any withdrawal limitations. Even if we honor a nonconforming request, we may treat continued abuse of the stated limitations (if any) as your act of closing the account. Telephone transfers of funds from this account to another account with us, if otherwise arranged for or permitted, may be made by the same persons and under the same conditions generally applicable to withdrawals made in writing. \nWe will use the date the transaction is completed by us (as opposed to the date you initiate it) to apply frequency limitations. The fact that we may honor withdrawal requests that overdraw the available balance does not obligate us to do so later.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "DepositAccountAgreement.cdm.json/DepositAccountAgreement",
						"Name": "WithdrawalsStatement"
					}
				}
			],
			"ColumnSetEntityName": "180ebf96-3d1d-4e2e-aaca-ccdcbaa1ab26",
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://workspace@jam710adls.dfs.core.windows.net/ConsumerGoods_vfz/DepositAccountAgreement",
					"delimiter": ",",
					"firstRowAsHeader": "false",
					"multiLine": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://workspace@jam710adls.dfs.core.windows.net/ConsumerGoods_vfz/DepositAccountAgreement",
				"Properties": {
					"LinkedServiceName": "synapsedemojamesbas-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ContractId\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ContractId\"},\"AccountOwnershipStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AccountOwnershipStatement\"},\"AuthorizedSignersStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AuthorizedSignersStatement\"},\"AccountVerificationServicesStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AccountVerificationServicesStatement\"},\"AdjustmentsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AdjustmentsStatement\"},\"BusinessDaysStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"BusinessDaysStatement\"},\"CashTransactionStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CashTransactionStatement\"},\"CashiersChecksStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CashiersChecksStatement\"},\"ChangeInOwnershipStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ChangeInOwnershipStatement\"},\"ChangeOfAddressStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ChangeOfAddressStatement\"},\"ChangeInTermsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ChangeInTermsStatement\"},\"CheckPrintingAndCheckOrderingStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CheckPrintingAndCheckOrderingStatement\"},\"CheckEndorsementStandardsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CheckEndorsementStandardsStatement\"},\"CheckSafekeepingStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CheckSafekeepingStatement\"},\"ClosingOrSuspendingAccountsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ClosingOrSuspendingAccountsStatement\"},\"DeathOrIncompetencyStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DeathOrIncompetencyStatement\"},\"DemandDraftsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DemandDraftsStatement\"},\"DepositsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DepositsStatement\"},\"DepositsOfForeignCurrencyInstrumentsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DepositsOfForeignCurrencyInstrumentsStatement\"},\"DormantOrInactiveAccountsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DormantOrInactiveAccountsStatement\"},\"EarlyWithdrawalPenaltiesStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"EarlyWithdrawalPenaltiesStatement\"},\"FacsimileSignaturesStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"FacsimileSignaturesStatement\"},\"GoverningLawStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"GoverningLawStatement\"},\"AccountHandlingStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AccountHandlingStatement\"},\"IdentificationRequirementsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"IdentificationRequirementsStatement\"},\"InternetLiabilityStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"InternetLiabilityStatement\"},\"LegalProcessStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"LegalProcessStatement\"},\"LiabilityStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"LiabilityStatement\"},\"LostItemsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"LostItemsStatement\"},\"NoticeOfWithdrawalStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"NoticeOfWithdrawalStatement\"},\"NoticesRegardingAnAccountStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"NoticesRegardingAnAccountStatement\"},\"OtherAgreementsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"OtherAgreementsStatement\"},\"OverdraftAndReturnedChecksStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"OverdraftAndReturnedChecksStatement\"},\"PostdatedChecksStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"PostdatedChecksStatement\"},\"PowerOfAttorneyStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"PowerOfAttorneyStatement\"},\"BankReservationOfRightsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"BankReservationOfRightsStatement\"},\"ResolvingDisputesOrControversiesStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ResolvingDisputesOrControversiesStatement\"},\"ReturnedItemsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ReturnedItemsStatement\"},\"RightOfSetoffStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"RightOfSetoffStatement\"},\"SeverabilityStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"SeverabilityStatement\"},\"SignatureVerificationPolicyStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"SignatureVerificationPolicyStatement\"},\"StaleDatedChecksStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"StaleDatedChecksStatement\"},\"StatementsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"StatementsStatement\"},\"StopPaymentOrdersStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"StopPaymentOrdersStatement\"},\"SubstituteChecksAndYourRightsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"SubstituteChecksAndYourRightsStatement\"},\"TaxpayerInformationStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"TaxpayerInformationStatement\"},\"TelephoneTransfersStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"TelephoneTransfersStatement\"},\"WaiversStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"WaiversStatement\"},\"WithdrawalsStatement\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"WithdrawalsStatement\"}}}"
			},
			"Compressed": false,
			"SerDeInfo": null,
			"IsStoredAsSubdirectories": false
		},
		"Owner": null,
		"CreateTime": 0,
		"LastAccessTime": 0,
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false,
		"ViewOriginalText": null,
		"ViewExpandedText": null,
		"Origin": {
			"Type": "SPARK"
		},
		"OriginObjectId": null,
		"IsSharedEntity": false,
		"PublishStatus": "PUBLISHED",
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"DepositAccountAgreement\",\"path\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\"},\"description\":\"An agreement for a deposit account with the bank.\",\"primaryKey\":[\"ContractId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ContractId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Contract.\",\"isNullable\":false,\"name\":\"ContractId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AccountOwnershipStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nAccount Ownership\\nYou may open an account in your name alone, or with one or more parties. The following is a brief summary of the general forms of account ownership available. \\nNOTE: Because decisions concerning whether an account should be held in a particular capacity may have significant legal, tax and estate planning consequences, consultation with your attorney or tax advisor is recommended. \\nIndividual Account - Owned in the name of one person. \\nJoint Account - All funds held in joint accounts are the property of the person(s) named on the Signature Card and all owners have an equal and undivided ownership interest in the whole account during their lifetimes. All joint accounts at \\\"bank name\\\" are joint accounts with right of survivorship; therefore, on the death of one party named on the account, all sums in the account vest in and belong to the surviving party(ies) as his/her own separate property. We will not recognize any claims of the deceased depositor's estate or any provisions of the deceased depositor's will. Payment of funds in the account to the surviving party(ies) constitutes a full release and discharge of us. It is the owner's sole responsibility to determine the legal effects of opening an account of this nature. \\nCalifornia Uniform Transfers To Minors Act Account (CUTMA) - The transferor of the CUTMA funds and the CUTMA account custodian understand and agree that upon creation of the account, the funds in the account, including any additions thereto and interest accruing thereon, are transferred, irrevocably, to the minor beneficiary of the account. The CUTMA account must be maintained by the custodian pursuant to the provisions of the California Uniform Transfers to Minors Act. The custodian has the sole authority to transact business on the account. Each CUTMA account may have only one custodian and one minor beneficiary. If the custodian resigns, is removed or dies, we will recognize the designated successor custodian or guardian of the minor if no successor custodian of the CUTMA is initially named. \\nSole Proprietorship - As a sole proprietorship account, you warrant, as an individual, that you are the sole owner of your business. If you operate under a fictitious business name, your account will be opened in your individual name doing business as your fictitious business name, and we will require you to furnish a copy of a filed fictitious business name statement and proof of required publication. \\nFictitious Business Name - If the name in which the account is held is fictitious, a copy of a filed fictitious business name statement and proof of publication will be required. Each account holder represents that one or more of the accountholders has the right to use that name and have fulfilled all legal requirements for using and/or doing business under that name. \\nCorporation/Non-Profit Organization - A corporation is a business operating for profit or not for profit pursuant to articles of incorporation and by-laws and chartered under the laws of a state or foreign country. A corporation may be required to submit copies of appropriate corporate documents as proof of existence and that the designated signers are authorized to act on behalf of the corporation. We may require a corporation to submit additional corporate documents as support for any request to change the authorized signers on the account. \\nLimited Liability Companies - A limited liability company or domestic limited liability company means an entity having one or more members that is organized under Title 2.5 of the California Corporations Code, or a limited liability company organized under other similar applicable state law. \\nUnincorporated Associations - An informal association of individuals or other business entities. To open an account in the name of an unincorporated association, we may require the association to submit documents demonstrating the existence of the association and the authority of the designated individuals to act on behalf of the association and any necessary fictitious business name documentation. \\nPartnership Account - This is an association of two or more persons to carry on as co-owners of a business for profit. In order to open a partnership account, we will require all general partners to sign the signature card creating the account. The partners signing to create the account warrant that they are all the general partners of the partnership or, if less than all the general partners, they are authorized to act on behalf of the partnership in opening the account and designating signers on the account. At our discretion, we may require the partnership to submit copies of selected partnership documents demonstrating existence of the partnership and the authority of the designated signers to open the account and transact business on the account and any necessary fictitious name documentation. We will require a partnership to submit additional partnership documents as support for any request to change the authorized signers on the account. \\nLimited Partnership - Means a partnership formed by two or more persons with one or more general partners and one or more limited partners, or their equivalents under any name. \\nFiduciary - An account opened under court authorization by executors, administrators, conservators, guardians, or by trustees under written trust agreements. The Bank may require that a certified copy of the court order or trust agreement be provided to the Bank, verifying that the person opening the account is a designated fiduciary, the powers of the fiduciary, provisions for succession, and other specific provisions. \\nPay On Death Account with Single Party - This account is owned by the named party. Upon the death of that party, ownership passes to the named pay-on-death payee(s). \\nPay On Death with Multiple Parties - This account is owned by the named parties. Upon the death of any one of them, ownership passes to the survivor(s). Upon the death of all of them, ownership passes to the named pay-on-death payee(s).\",\"isNullable\":true,\"name\":\"AccountOwnershipStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AuthorizedSignersStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nAuthorized Signers\\nThe following terms apply to individual accounts and those with more than one signer: \\n\\\" We may endorse checks for you that we receive for deposit. \\n\\\" We may transfer funds between your accounts, transfer your accounts, and take other actions per the written instructions of any signer subject to any signature requirement on the account. \\n\\\" We may rely on the information that you give us and we enter into our records, until you notify us in writing of a change. \\n\\\" If we believe there is a dispute about ownership or control of the account, we may place a hold on the funds and not release the funds until we receive either a court order or instructions signed by all persons claiming interest in the account. \\n\\\" We may deduct amounts you owe us, such as fees and charges, from your account. \\nThe following terms apply only to accounts with more than one signer: \\n\\\" We may require the signatures of all signers if there are any conflicts among you. \\n\\\" We may cash or deposit all checks payable to any signer when endorsed by any other signer. \\n\\\" Each signer is individually liable for debts owed to \\\"bank name \\\"on an account, regardless of which signer incurred the debt.\",\"isNullable\":true,\"name\":\"AuthorizedSignersStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AccountVerificationServicesStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nAccount Verification Services\\nNew and existing accounts are subject to verification through ChexSystems and may be declined based on adverse information. All parties to an account are subject to verification. Should you be denied the opportunity to open or sign on an account because of negative information, you may request, in writing, a file copy through 'system name'.\",\"isNullable\":true,\"name\":\"AccountVerificationServicesStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AdjustmentsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe may make adjustments to your account from time to time. This may be due to the return of a check that you deposited which was unpaid or a deposit posted in the wrong amount.\",\"isNullable\":true,\"name\":\"AdjustmentsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"BusinessDaysStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nMonday through Friday, 9:00 a.m. to 4:30 p.m., are business days. If you make a deposit after the close of business, or on Saturday, Sunday, or holidays, the day of deposit will be the next business day. Refer to the Regulatory Disclosure regarding ATM and foreign ATM deposits.\",\"isNullable\":true,\"name\":\"BusinessDaysStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CashTransactionStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nPursuant to Federal law and regulations, we are required to report large domestic transactions in cash or coin to the Treasury. We are also required to maintain records on certain purchases of monetary instruments.\",\"isNullable\":true,\"name\":\"CashTransactionStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CashiersChecksStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou do not automatically have the right to stop payments on Cashier's Checks you purchase from us. In the event that a Cashier's Check is lost, stolen, or destroyed, please contact us as soon as possible for the procedures to follow to obtain reimbursement or have the Cashier's Check reissued. In general, you will have to complete and sign, under penalty of perjury, a declaration of loss. The declaration of loss should describe the cashier's check and how it came to be lost, stolen, or destroyed. We may then wait ninety (90) days from the date the check was issued before we pay your claim. If ninety (90) days has already passed, then we will act on your claim within a reasonable time. If the check is presented during the ninety (90) day waiting period, we may pay the item to a person entitled to enforce the check. If this happens, we will not pay your claim.\",\"isNullable\":true,\"name\":\"CashiersChecksStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ChangeInOwnershipStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nAll of the Bank's accounts are non-negotiable and non-transferable except upon the books of the Bank. The ownership of an account may not be changed except upon any required signature authority. Where ownership of an account is changed, \\\"bank name\\\" will close the existing account and open a new account in the name of the new accountholder.\",\"isNullable\":true,\"name\":\"ChangeInOwnershipStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ChangeOfAddressStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou agree to notify us in writing or in person in the event that you change your mailing address. You authorize us to obtain your current residence address from the Department of Motor Vehicles and waive your rights under California Vehicle Code Section 1808.21 or any other similar applicable state law.\",\"isNullable\":true,\"name\":\"ChangeOfAddressStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ChangeInTermsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nThe Bank may change the terms and conditions governing your account at any time by giving you written notice thereof. We will give you advance notice of any such change when required by applicable law. If you maintain your account or permit your certificate account to renew upon maturity after the effective date for the change, you agree to the change.\",\"isNullable\":true,\"name\":\"ChangeInTermsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CheckPrintingAndCheckOrderingStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nIf you order checks through us, you will be charged for the check printing. The amount varies depending on the style and quantity of checks you order. \\n\\nIf you order checks directly from an outside check printer or use computer generated checks, they must be printed using a standard format that can be read and processed by our equipment. If the checks ordered from non-Bank authorized check printers are considered \\\"unreadable,\\\" we may charge you a special processing fee and/or require that you obtain serviceable checks. You agree not to use any checks that contain a background image that interferes with our or any other Bank's ability to produce a digital image of your check. If you do, you will be responsible for any losses you or another person suffers because of the inability to produce a readable check. You further agree to use checks that contain certain high security features such as a real watermark, thermochromatic ink, and paper that is sensitive to at least 15 chemicals. If you choose to use checks that do not contain these security features, you will be responsible for any losses you or another person suffer due to a criminally altered or replicated check. \\n\\nYou agree not to print special limitations on checks, withdrawal orders or other items drawn on your account, such as \\\"void over $100\\\" or \\\"paid in full\\\" or \\\"void after ninety (90) days.\\\" If you do print any special limitations, you agree that we are not bound by such limitations and you authorize us to pay such items without regard to the limitation(s). \\n\\nYou are responsible for checking the accuracy of all information shown on your checks whether ordered through us or third parties. We are not liable for losses resulting from incorrectly printed checks.\",\"isNullable\":true,\"name\":\"CheckPrintingAndCheckOrderingStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CheckEndorsementStandardsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nGovernment regulations specify both how you endorse checks that you ask us to cash or deposit, and what you may place or have preprinted on the back of checks. \\n\\\" The top 1 1/2 inches of the back of the check is the area designated for your endorsement as payee. \\n\\\" The center portion of the check is reserved for bank use. \\n\\\" The remainder of the check is used for subsequent bank endorsements. \\nIf you endorse a check in the area reserved for bank use, or your endorsement is illegible, you are liable for checks that are returned late or unpaid. \\n\\nGovernment, insurance, and title company checks must have the personal endorsement of all payees. You authorize us to accept transfers, checks and other items for deposit to your account if they are made payable to, or to the order of, any one or more of you, whether or not they are endorsed by you. You authorize us to supply missing endorsements, and you warrant that all endorsements are genuine.\",\"isNullable\":true,\"name\":\"CheckEndorsementStandardsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"CheckSafekeepingStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe may retain the original checks written on your checking account and not return them in your monthly statement. We will include information about the check number, amount, and date the checks were paid on your monthly statement. You may request up to two (2) copies of checks free of charge for each monthly statement we send you.\",\"isNullable\":true,\"name\":\"CheckSafekeepingStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ClosingOrSuspendingAccountsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe may honor any authorized signer's request to close or suspend an account subject to any specific account signature requirements. At our discretion, we may require the signatures of all accountholders and/or authorized signers before permitting the withdrawal of funds or the closing or suspension of an account. We may return checks or other items, marked \\\"Refer to Maker\\\" or similar language, in the event there is a dispute over the ownership or control of an account. \\n\\nWe may close your account at any time, with or without cause, and remit the balance to you at the last address we have on file for you. You may close your account at any time upon notice to us, subject to any applicable early withdrawal penalty and/or any specific signature requirements. You will remain liable for the payment of accrued fees on the account and for checks in the collection process. If your account has been open for less than twelve (12) months, you may be subject to an early closure fee. Refer to the current Schedule of Fees and Charges. \\n\\nIf you or we have reason to believe your account has been compromised, we may close your account at our discretion.\",\"isNullable\":true,\"name\":\"ClosingOrSuspendingAccountsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DeathOrIncompetencyStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou agree to notify the Bank promptly if any owner or authorized signer on your account dies or is declared incompetent by a court of appropriate jurisdiction. We may place a hold on an account and refuse to accept deposits or requests for withdrawal upon receipt of notice that the owner or signer has died or has been declared incompetent by a court of appropriate jurisdiction. We will not release funds to a successor, or to a representative of a deceased owner's estate, or to a conservator for an owner except upon submission of documentation demonstrating the death or incompetence of the customer and the authority of the representative, successor, or conservator to take possession or delivery of the funds. Where a non-owner signer on an account dies or is declared incompetent, our general rules regarding changing signers on accounts will apply. Until the Bank has received written notice of the death or incompetence of any account signer, it may rely and act upon the signature of such deceased signer. We may suspend, refuse, and reverse any transactions or deposits (for example, automatic Federal direct deposits of benefit payments belonging to the decedent) if any owner or authorized signer dies or is declared by a court to be incompetent. \\n\\nUpon the death of an accountholder, the manner in which we release the account or any interest in the account will depend on the vesting of the account, the size of the estate, and/or the state of residence at the time of death. To determine how the account or your interest in an account must be released upon your death, we may require your successor or personal representative to submit a certified copy of your death certificate and any other documents we deem necessary, at our sole discretion, to establish who is entitled to delivery of your account or your share of the account.\",\"isNullable\":true,\"name\":\"DeathOrIncompetencyStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DemandDraftsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nIf you voluntarily give information about your account (such as our routing number and your account number) to a party who is seeking to sell you goods or services, and you don't physically deliver a check to the party, any debit to your account initiated by the party to whom you gave the information is deemed authorized.\",\"isNullable\":true,\"name\":\"DemandDraftsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DepositsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou warrant that all endorsements on items deposited to your account are genuine. In the event you fail to endorse an item deposited to your account, you agree that we may supply your missing endorsement. You agree to reimburse us for any loss, cost, or expense we incur as a result of your failure to endorse an item exactly as drawn. If we received an affidavit stating that one or more endorsements on a check or other item deposited into your account is forged, we may freeze the amount or charge back the amount of the item to your account, without prior notice to you, even though you may have already used the funds. In the case of a certificate of deposit, the account will be closed. \\n\\nWe reserve the right to refuse to accept items for deposit that bear more than one endorsement or the endorsement of individuals who are not known to us. If you wish to deposit an item that has been previously endorsed by one or more individuals, we reserve the right to require all endorsers to be present before we accept the item or that their endorsements be guaranteed by their financial institutions. \\n\\nAny credit to an account is subject to final verification, payment, and adjustment by us. We are obligated only to use ordinary care in collecting items on your behalf. We shall not be liable for the negligence of other banks in the collection of checks and other items. If we give provisional credit for an item, we reserve the right to charge back the amount of the item if we do not receive final payment. \\n\\nUnless you have instructed us to the contrary, we reserve the right, but are not required, to send a returned deposited item back for payment a second time before notifying you. At our option, this resending may be done electronically. Returned deposited items may incur charges to your account. Refer to the current Schedule of Fees and Charges. \\n\\nIf, in connection with a direct deposit plan, we deposit any amount in an account which should have been returned to the Federal government for any reason, you authorize us to deduct the amount of the liability to the Federal government from the account or from any other account you have with us, without prior notice and at any time, except as prohibited by law. We may also use any other legal remedy to recover the amount of the liability.\",\"isNullable\":true,\"name\":\"DepositsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DepositsOfForeignCurrencyInstrumentsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nThe Bank may refuse to accept for deposit or collection items that are payable in currency other than U.S. dollars (a \\\"foreign currency instrument\\\"). We handle such items as \\\"collection items,\\\" meaning that we send the item to the issuer's bank for payment. When the Bank receives the payment, we will credit your account. If the item is returned unpaid, we will return the item to you. The bank has sole discretion in determining whether to accept an item for deposit or collection. If the Bank accepts any such instrument for deposit or collection, you have all the risk associated with foreign currency exchange rates. Foreign currency instruments drawn on foreign banks may be returned unpaid later than instruments drawn on U.S. banks. You have the risk of late return. The Bank reserves the right to place longer holds on foreign currency instruments than the timeframes specified in the Bank's funds availability policy for domestic items.\",\"isNullable\":true,\"name\":\"DepositsOfForeignCurrencyInstrumentsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"DormantOrInactiveAccountsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nAn account on which there has been no activity for a period of time as provided by applicable state or Federal law may be considered inactive. Activity on an account includes, but is not limited to, transactions such as withdrawals and deposits, or account inquiries. An account may become dormant when no activity has occurred over an extended period of time. Applicable state law may require that the Bank remit or escheat the account balance to the state pursuant to applicable unclaimed property laws. \\n\\nMaintenance Fees and other applicable account fees and charges for dormant accounts will remain the same as they were when the account was active. Charges are not reimbursed for dormant accounts that are later reclassified as active. We may change the Schedule of Fees and Charges for dormant accounts. \\n\\nWe will try to notify you before we classify the account as dormant by sending a notice to the address we currently show on our records. We will hold all statements on your dormant account if we cannot contact you.\",\"isNullable\":true,\"name\":\"DormantOrInactiveAccountsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"EarlyWithdrawalPenaltiesStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Describes the penalties that will be imposed should the account holder decide to make premature withdrawals.\",\"isNullable\":true,\"name\":\"EarlyWithdrawalPenaltiesStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"FacsimileSignaturesStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou agree to obtain approval from us prior to using a facsimile signature for your accounts. If approved, you authorize us to honor all checks or other orders drawn on your account containing a facsimile signature, including those drawn to the individual order of any person whose name appears as facsimile signer. We may charge your account for all such checks or other orders, regardless of the circumstances under which the facsimile signature may have been used, if such signature resembles the specimen filed by you with us.\",\"isNullable\":true,\"name\":\"FacsimileSignaturesStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"GoverningLawStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nExcept as provided by conflicting Federal law or regulation, accounts shall be governed by the state laws applicable to the branch location where your account was established.\",\"isNullable\":true,\"name\":\"GoverningLawStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"AccountHandlingStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe will process and pay your checks in accordance with reasonable banking standards. Our automated processing of checks, an industry-wide practice by which not all maker signatures are examined, will be considered to comply with reasonable banking standards. \\n\\nYou agree to maintain your unused and cancelled checks in a secure area and to properly guard against improper access to them. You further agree that you will not entrust the writing of checks and reconcilement/review of your account statement to the same person without your frequent monitoring. We reserve the right to deny a claim for monetary loss due to forged, altered, or unauthorized checks if you fail to follow these procedures. We agree to exercise ordinary care in paying items against your account. \\n\\nWe may continue to honor your instructions until we receive written notice of any changes from you and have had a reasonable opportunity to act. You authorize us to pay items signed by formerly authorized signers for a reasonable period of time after we receive your notice of changes as to your authorized signers. Refer questions about this Agreement to your branch of account.\",\"isNullable\":true,\"name\":\"AccountHandlingStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"IdentificationRequirementsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nTo open an account at the Bank, you will need one current form of acceptable identification. Provisions of the Bank Secrecy Act and IRS code require that we obtain an appropriate Social Security number or taxpayer identification number (TIN). Deposit accounts for fiduciaries, partnerships, limited liability entities, corporations, and fictitious business names will also need to provide the Bank with valid documentation of existence, such as articles of incorporation, court orders, partnership agreements, fictitious business name statements, and/or any other documents that the Bank deems necessary. Please refer to the Customer Identification Program section in the Regulatory Disclosure.\",\"isNullable\":true,\"name\":\"IdentificationRequirementsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"InternetLiabilityStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe maintain an Internet website for transactional activities and to provide information regarding our products and services and other bank related information. If you submit information to us over the Internet via email, please be advised that the information you send to us is not secure or confidential and may be observed by third parties while in transit to us. We cannot act on instructions sent to us from an external email address. We will not be liable to you for any damages you may sustain arising from the observation by any third party of confidential information you send via email to us over the Internet. Check with your Internet Service Provider or refer to your browser \\\"Help File\\\" for more details about Internet security.\",\"isNullable\":true,\"name\":\"InternetLiabilityStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"LegalProcessStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nIf we are served with any legal process relating to your account (for example, subpoena, restraining order, writ, etc.), we must comply as required by law. We will attempt to notify you of such action in writing at the last address we have in our records for you unless we are prohibited by law or court order from doing so. If we receive legal process that affects your account, we will charge a processing fee to your account unless otherwise provided by law. We may accept service of an IRS Notice of Levy or a release of such a levy by facsimile transmission. \\n\\nAny garnishment or levy against your account is subject to our right of setoff against the account. In the event that a garnishment or levy reduces the account balance to a level insufficient to pay items presented for payment against the account, we are not liable for dishonoring the items. When an IRS Levy is received prior to 11:00 a.m. and the balance of the account(s) affected is not sufficient to satisfy the Levy, all checks that were paid the night before (excluding \\\"on-us checks\\\" payable to bank or cashed at bank) will be reversed and returned\",\"isNullable\":true,\"name\":\"LegalProcessStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"LiabilityStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou agree to the terms of this account and the Schedule of Fees and Charges. You authorize us to deduct these charges directly from the account balance. You will pay any additional reasonable charges for services you request that are not covered by this agreement. \\n\\nEach of you also agrees to be individually, jointly and severally liable for any account shortage resulting from charges or overdrafts, whether caused by you or another person with access to this account. This liability is due immediately, and can be deducted directly from your account balance whenever sufficient funds are available. You have no right to defer payment of this liability, and you are liable regardless of whether you signed the item or benefited from the charge or overdraft. This includes liability for our costs to collect the deficit to the extent permitted by law, including our reasonable attorney's fees.\",\"isNullable\":true,\"name\":\"LiabilityStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"LostItemsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe act only as a collection agent for you when we receive a check for deposit or which we cash for you. If that check or other item is lost, stolen, or destroyed in the process of collection, we may reverse the credit for any deposit or charge your account for the cashed check or item.\",\"isNullable\":true,\"name\":\"LostItemsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"NoticeOfWithdrawalStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nFederal regulations require the Bank to reserve the right to require seven (7) days prior written notice for any withdrawal from Savings, Interest Checking, and Money Market accounts.  While the Bank must reserve this right, it is not our general policy to exercise it.\",\"isNullable\":true,\"name\":\"NoticeOfWithdrawalStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"NoticesRegardingAnAccountStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe may send statements and notices to any party on an account by mailing or delivering a notice to the last address we have on file for the account. Notice to any accountholder or authorized representative shall be deemed to be notice to all accountholders. We generally mail the notice before the effective date of the change. \\nIf we hold statements or notices relating to the account at your request, or because you fail to give us a current address for the account, the notices are deemed delivered to you upon receipt or preparation by the office of the account. Any notice or statement returned to us as undeliverable shall be deemed delivered to you as of the date it is deposited by us in the mail. \\nYou must deliver to us, during normal banking hours, all notices that are requested by this Agreement or by law at the office that holds your account or any other address we specify. If you have multiple accounts or services, you may have to send notices to more than one office.\",\"isNullable\":true,\"name\":\"NoticesRegardingAnAccountStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"OtherAgreementsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou may have another agreement with us which, by its terms, supersedes this Agreement in whole or in part. For example, if you are a business customer, certain provisions of your other agreements (such as an Account Analysis Agreement or Night Depository Agreement) may supersede some of the terms of this Agreement, to the extent that they are inconsistent. If you are a consumer, your accounts may also be governed in part by one or more electronic fund transfer agreements.\",\"isNullable\":true,\"name\":\"OtherAgreementsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"OverdraftAndReturnedChecksStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nIf there are insufficient funds available in your account to pay a check or transaction, it may be returned unpaid. However, we may, at our sole discretion, create an overdraft by paying the check or item or by permitting the transaction. In either case, there will be a service charge for each non-sufficient funds (NSF) item and/or transaction and/or continuous daily overdrafts.\",\"isNullable\":true,\"name\":\"OverdraftAndReturnedChecksStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"PostdatedChecksStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe may charge your account for an item that is otherwise properly payable from the account even though we pay the check before the date on it, unless you give us special \\\"notice of postdated check.\\\" You can give this special notice to us orally, but it must be received by us in order to give us a reasonable opportunity to act before the final payment of the item. In placing your notice of postdated check, you must describe the check by giving the date, the check number, the exact amount of the check, and the name of the payee in order for us to return the item if it is presented for payment before the date on the check. We require that you put your notice of postdated check in writing to us within fourteen (14) days. We have a special form for this purpose. If you do not put your notice in writing, then your notice of postdated check will expire at the end of the fourteen (14) day period. If you put your notice in writing to us, then your notice of postdated check will remain in effect until the date of the check. We impose a fee for each notice of postdated check.\",\"isNullable\":true,\"name\":\"PostdatedChecksStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"PowerOfAttorneyStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nThe Bank can provide you with a power of attorney form for your use in appointing a person or persons to sign on your account, and sign and endorse checks or other items, on your behalf, as your agent. You are bound by, and responsible for, the actions of your agent. \\nThe Bank may recognize an agent appointed by you on a power of attorney document other than that supplied by us. If you do not use one of our power of attorney forms, bank may refuse to honor that power of attorney. However, in most cases, we will accept the Uniform Statutory Form Power of Attorney as set forth in the California Civil Code, subject to approval by the Bank's counsel. We may require a separate form for each account for which you want to grant power of attorney. \\nThe Bank may refuse to honor a power of attorney if the power of attorney is not properly notarized when presented or is otherwise irregular.\",\"isNullable\":true,\"name\":\"PowerOfAttorneyStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"BankReservationOfRightsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nReservation of Rights \\n\\\"bank name\\\" reserves the right to: \\n\\\"Refuse to open any account, or to service or to accept additional deposits to an existing account; \\n\\\"Limit the principal balance of any account; and \\n\\\"Close an account at any time.\",\"isNullable\":true,\"name\":\"BankReservationOfRightsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ResolvingDisputesOrControversiesStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe try to resolve our customers' problems or disputes as quickly as possible. In most cases, we can resolve a problem in a branch or by telephone. Any dispute or controversy regarding your deposit account relationship will be decided by either arbitration or referee. Under the procedures, the dispute is submitted to a neutral person for determination in place of trial before a judge or jury. A dispute or controversy involving one deposit account relationship, or two or more deposit account relationships with at least one common owner, is decided by arbitration under the Commercial Arbitration Rules of the American Arbitration Association. Any other dispute or controversy is decided by reference under California Code or Civil Procedure Section 638 and related sections or any other similar governing state law. A referee, either an active attorney or a retired judge, is selected according to the procedures by selecting arbiters of the American Arbitration Association and is then appointed by the court in which the action regarding the dispute or controversy is pending. \\nIn the event there is a dispute over the ownership or control of an account, the Bank, at its option, may return items and refuse to accept further deposits until all parties to the account agree in writing as to the resolution of the dispute. In the event that the dispute is not resolved within a reasonable time, the Bank, at its option may either (1) close the account and deliver a cashier's check for any remaining balance to the last address on file with us, or (2) it may tender the proceeds of the account into court, all without liability.\",\"isNullable\":true,\"name\":\"ResolvingDisputesOrControversiesStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"ReturnedItemsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nIf a check or other item that we cash for you or which you deposit to your account is returned to us as unpaid for any reason, we may charge your account for the amount of the check or other item plus a Returned Deposited Item fee. This may include, among other circumstances, checks that are returned because the maker of the check had insufficient funds in its account and checks that were paid originally and later returned to us accompanied by an affidavit which states that the endorsement is forged or unauthorized or that the item has been altered in any way. We may charge your account for the amount without questioning the truth of such an affidavit. \\nWe may, at our option, notify you by telephone if an item has been returned unpaid. If you authorize us to redeposit the item on your behalf, you waive any right to receive a written notice of the returned item and you authorize us to charge back the item to your account if it is returned unpaid again for any reason. Refer to the Schedule of Fees and Charges for information on Returned Deposited Item fees.\",\"isNullable\":true,\"name\":\"ReturnedItemsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"RightOfSetoffStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nThe law provides that we may, in certain circumstances, take funds on deposit in your account to satisfy a debt you owe us. This is called the right of setoff. If we exercise this right of setoff, we shall comply with all applicable laws and regulations and we will notify you promptly of the action taken. All sums in a deposit account are subject to our right of setoff for liabilities owed to us by any or all of the accountholders, to the fullest extent permitted by law. \\nIf we exercise our right of setoff against an account that is subject to an early withdrawal penalty, the account will be assessed the applicable early withdrawal penalty. \\\"bank name\\\" may recover funds you owe us from any of your deposit accounts.\",\"isNullable\":true,\"name\":\"RightOfSetoffStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"SeverabilityStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nIf any of the provisions of this Agreement are determined to be void or unenforceable, the remainder of this Disclosure shall remain in full force and effect.\",\"isNullable\":true,\"name\":\"SeverabilityStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"SignatureVerificationPolicyStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nOur signature verification policy meets the standard of ordinary care. The number of required signatures for an account is noted on the account signature card. If there is no number noted on the signature card, then any one of the authorized signers may sign checks or withdrawal orders and give us instructions regarding the account. \\nYou understand and agree that the method in which checks are paid makes it beyond the control of the Bank to guarantee that checks are paid in accordance with Depositor's special restrictions or requirements relating to authorized signatures noted on the signature card for that account. You represent that such restrictions are for the sole benefit of Depositor and intended only as an internal company policy and control. Depositor further stipulates that, as issuer of said checks, the control, monitoring, and enforcement of internal signature authority is the sole responsibility of Depositor. The Depositor therefore agrees to hold harmless and indemnify the Bank against any and all liability for the payment of items that do not conform to the Depositor's own restrictions or requirements relating to multiple or tiered signatures stated on the signature card and the face of checks. However, if there is a conflict, the Bank reserves the right to require all authorized signers to sign a check or withdrawal order. \\nEven if the authorized signers on an account change, we may continue to honor checks, withdrawal orders, and other instructions by authorized signers until we are notified in writing. \\nAll account holders on a joint account authorize the other account holders to endorse items made payable to the name of any person appearing on the Signature Card as an owner and deposit these endorsed items into the joint account. Each accountholder may transfer or withdraw the funds on deposit at any time, subject to the limitations set forth in the preceding paragraphs.\",\"isNullable\":true,\"name\":\"SignatureVerificationPolicyStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"StaleDatedChecksStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nUpon presentment of an item for payment more than six (6) months after its date, we may charge your account for the item; however, we are not obligated to do so. If you want to ensure that we do not pay a stale-dated item, you should place a stop payment order on the item.\",\"isNullable\":true,\"name\":\"StaleDatedChecksStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"StatementsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWith certain exceptions, we provide accountholders with statements listing account transactions. You agree to examine your statements as soon as you receive them. You assume full responsibility for monitoring and reviewing the activity of your account and the work of your employees, agents, and accountants. You agree to notify us immediately if you think there is an error or an unauthorized transaction shown on your statement. Unless you notify us promptly, we will assume the statement is correct. If we send you a statement or item which contains or discloses an unauthorized signature or an alteration, you must notify us promptly of that fact, but no later than thirty (30) days after we deliver the item or statement to you. If you delay in examining your records or in reporting a problem, the delay may affect our ability to resolve the problem and you may be liable for losses that occur as a result of the delay. We may refuse to reimburse you for subsequent unauthorized transactions by the same wrongdoer(s). If you find that your records and our records disagree, you must call your branch of account immediately during regular business hours. \\nIf you claim a credit or refund because of a forgery, alteration, or any other unauthorized withdrawal, you agree to provide us with an affidavit containing whatever reasonable information we require concerning your account, the transaction, and circumstances surrounding your claim. \\nSpecial procedures apply to claims involving substitute checks. Please see the section of this Agreement titled, \\\"Substitute Checks and Your Rights\\\" for more information. \\nYou agree to exhaust your remedies against your bonding or insurance company before making a claim against us for forgeries, alterations, or unauthorized payment orders in which your employee has been involved. \\nYou agree that we may take a reasonable period of time to investigate the facts and circumstances surrounding any claimed loss, and that we will have no obligation to provisionally re-credit your account during our investigations. Your statements and notices will be mailed to the last address we have on file for the account. \\nYou assume full responsibility for notices, vouchers, checks, items, statements, and other documents which are lost, destroyed, or stolen while in the mail or in transit to or from you or a third party. You agree to promptly return any checks or other items to us which do not belong to you. If statements are returned to the Bank by the Postal Service as undeliverable, we will retain the statement for a period of sixty (60) days and then destroy the statements and their contents.\",\"isNullable\":true,\"name\":\"StatementsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"StopPaymentOrdersStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYou may place a written or oral stop payment order on checks written against an account with check access. Oral orders must be confirmed in writing within fourteen (14) calendar days. We will accept a renewal order request from any authorized signer on an account. We may charge a fee for each stop payment order. Please refer to the current Schedule of Fees and Charges. Stop payment orders remain in effect for six (6) months unless renewed. If the check is presented for payment after the order expires, the Bank assumes no responsibility and may pay the check. We will cancel a stop payment order at any time with written authorization. We will not be liable for paying a check on the day we accept the stop payment request or if the check is cashed while our data processing system is not operating. To be effective, a stop payment request must accurately identify the account number, the check number, date of the check, amount of the check, and the payee.\",\"isNullable\":true,\"name\":\"StopPaymentOrdersStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"SubstituteChecksAndYourRightsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWhat is a Substitute Check?\\nTo expedite check processing, federal law permits banks to replace checks with \\\"substitute checks.\\\" These checks are similar in size to original checks with a slightly reduced image on the front and back of the original check. The front of an original check states: \\\"This is a legal copy of your check. You can use it the same way you would use the original check.\\\" You may use a substitute check as proof of payment just like the original check. \\nSome or all of the checks that you receive back from us may be substitute checks. This section describes the rights you have when you receive substitute checks from us. The rights in this section do not apply to original checks or electronic debits to your account. However, you have rights under other law with respect to those transactions. \\nWhat are my rights regarding substitute checks?\\nIn certain cases, federal law provides a special procedure that allows you to request a refund for losses you suffer if a substitute check is posted to your account (for example, if you think we withdrew the wrong amount or that we withdrew money from your account more than once for the same check). The losses you may attempt to recover under this procedure may include the amount that was withdrawn from your account and fees that were charged as a result of the withdrawal (for example, Non-Sufficient Funds fees-see the Schedule of Fees and Charges for more information). \\nThe amount of your refund under this procedure is limited to the amount of your loss or the amount of the substitute check, whichever is less. You are also entitled to interest on the amount of your refund if your account is an interest-bearing account. If your loss exceeds the amount of the substitute check, you may be able to recover additional amounts under other law. \\nIf you use this procedure, you may receive up to $2,500.00 of your refund (plus interest if your account earns interest) within 10 business days after we receive your claim and the reminder of your refund (plus interest if your account earns interest) not later than 45 calendar days after we receive your claim. \\nHow do I make a claim for a refund?\\nIf you believe you have suffered a loss relating to a substitute check you received and that was posted to your account, please contact us in writing at: \\\"bank name and address\\\".  We may require that you submit your claim in writing within 14 days of oral notification. You must contact us within 40 calendar days of the date we mailed (or otherwise delivered by a means to which you agreed) the substitute check in question or the account statement showing that the substitute check was posted to your account, whichever is later. We will extend this time period if you were not able to make a timely claim because of extraordinary circumstances. \\nYour claim must include the following: \\n\\\" A description of why you have suffered a loss (for example, you think the amount withdrawn was incorrect); \\n\\\" An estimate of the amount of your loss; \\n\\\" An explanation of why the substitute check you received is insufficient to confirm you suffered a loss; and \\n\\\" A copy of the substitute check and identifying information such as the check number, the name of the person to whom you wrote the check, the amount of the check, etc. \\n\\nOther Important Information About Substitute Checks\\nUnless we specifically permit you to do so, you may not deposit any substitute check that has not previously been handled by a bank in the U.S. collections process. This means you cannot deposit a substitute check you create, or one that is created by another person, unless we enter into an agreement to do so. \\nYou agree not to use any checks that contain a background image that interferes with our or any other bank's ability to produce a digital image of your check. If you do, you will be responsible for any losses you or another person suffers because of the inability to produce a readable digital image of your check. \\nYou agree to use checks that include certain high security features, such as a real watermark, thermochromatic ink, and paper that is reactive to at least 15 chemicals. If you choose to use checks that do not contain these security features, you may be responsible for any losses you or another person suffer due to a criminally altered or replicated check.\",\"isNullable\":true,\"name\":\"SubstituteChecksAndYourRightsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"TaxpayerInformationStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nThe Bank is required to report annually to accountholders, the Internal Revenue Service (IRS), and to any governing state tax agencies, the interest payments that total $10.00 or more during a calendar year on each of your accounts. \\nAccordingly, when you open an account, \\\"bank name\\\" is required to obtain from each accountholder a valid Social Security number and/or TIN, and correct information regarding your backup withholding status. We are also required to report interest paid to a non-resident alien. When you sign the Signature Card for an account you certify that you have provided the correct Social Security number or TIN. \\n\\nIf you fail to furnish the Bank with your certified Social Security number or TIN, if the IRS notifies us that you gave us an incorrect number, or if you failed to report all your interest and dividends, the Bank may be required to withhold 30.5% of your interest and pay that withheld interest to the IRS. \\nAccounts held by exempt foreign persons are generally exempt from taxpayer information reporting unless the Bank is required to provide backup withholding to the IRS. For accounts with more than one owner, all owners must qualify and certify their status as an exempt foreign person. \\nIf you fail to furnish a correct TIN, you may be subject to a $50.00 IRS fine. If you make a false statement that has no reasonable basis and that results in no backup withholding, you may be subject to a $500.00 IRS penalty. If you deliberately give false information, you may be subject to criminal penalties.\",\"isNullable\":true,\"name\":\"TaxpayerInformationStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"TelephoneTransfersStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nThe bank will honor telephone requests for fund transfers between accounts held made by the same persons and under the same conditions generally applicable to withdrawals made in writing.\",\"isNullable\":true,\"name\":\"TelephoneTransfersStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"WaiversStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nWe may delay enforcing our rights under this Agreement without losing them. Any waiver by us shall not be deemed a waiver of other rights or of the same right at another time. You waive diligence, demand, presentment, protest, and notice of every kind, except as otherwise set forth in this Agreement.\",\"isNullable\":true,\"name\":\"WaiversStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"DepositAccountAgreement.cdm.json/DepositAccountAgreement\",\"name\":\"WithdrawalsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nUnless clearly indicated otherwise on the account records, any of you, acting alone, who signs in the space designated for signatures on the Signature Card may withdraw or transfer all or any part of the account balance at any time. Each of you (until we receive written notice to the contrary) authorizes each other person signing the Signature Card to endorse any item payable to you or on your order for deposit to this account or any other transaction with us. We may charge your account for a check even though payment was made before the date on the check, unless we have received written notice of the postdating in time to have reasonable opportunity to act. \\nWe may refuse to honor checks drawn on your account if they are directly presented to us by someone we cannot identify to our satisfaction. \\nAt our option, we may also require non-customers to provide a fingerprint, endorsement guarantee, or other assurance or documentation in connection with the transaction. \\nWe may refuse any withdrawal or transfer request which you attempt on forms not approved by us, by any method we do not specifically permit, which is greater in number than the frequency permitted, or which is for an amount greater or less than any withdrawal limitations. Even if we honor a nonconforming request, we may treat continued abuse of the stated limitations (if any) as your act of closing the account. Telephone transfers of funds from this account to another account with us, if otherwise arranged for or permitted, may be made by the same persons and under the same conditions generally applicable to withdrawals made in writing. \\nWe will use the date the transaction is completed by us (as opposed to the date you initiate it) to apply frequency limitations. The fact that we may honor withdrawal requests that overdraw the available balance does not obligate us to do so later.\",\"isNullable\":true,\"name\":\"WithdrawalsStatement\"}]}}}",
			"Description": "An agreement for a deposit account with the bank.",
			"DisplayFolderInfo": "{\"name\":\"Contract\",\"colorCode\":\"#000F5C\"}",
			"PrimaryKeys": "ContractId",
			"spark.sql.sources.provider": "csv",
			"x-ms-usageinfo": "AzureSynapseDatabaseTemplate",
			"spark.sql.sources.schema.numParts": "2",
			"spark.sql.sources.schema.part.0": "{\"type\":\"struct\",\"fields\":[{\"name\":\"ContractId\",\"type\":\"integer\",\"nullable\":false,\"metadata\":{}},{\"name\":\"AccountOwnershipStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"AuthorizedSignersStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"AccountVerificationServicesStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"AdjustmentsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"BusinessDaysStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"CashTransactionStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"CashiersChecksStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ChangeInOwnershipStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ChangeOfAddressStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ChangeInTermsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"CheckPrintingAndCheckOrderingStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"CheckEndorsementStandardsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"CheckSafekeepingStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ClosingOrSuspendingAccountsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"DeathOrIncompetencyStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"DemandDraftsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"DepositsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"DepositsOfForeignCurrencyInstrumentsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"DormantOrInactiveAccountsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"EarlyWithdrawalPenaltiesStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"FacsimileSignaturesStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"GoverningLawStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"AccountHandlingStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"IdentificationRequirementsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"InternetLiabilityStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"LegalProcessStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"LiabilityStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"LostItemsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"NoticeOfWithdrawalStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"NoticesRegardingAnAccountStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"OtherAgreementsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"OverdraftAndReturnedChecksStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"PostdatedChecksStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"PowerOfAttorneyStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"BankReservationOfRightsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ResolvingDisputesOrControversiesStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ReturnedItemsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"RightOfSetoffStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"SeverabilityStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"SignatureVerificationPolicyStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"StaleDatedChecksStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"StatementsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"StopPaymentOrdersStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"SubstituteChecksAndYourRightsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"TaxpayerInformationStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"TelephoneTransfersStatement\",\"type\":\"string\",\"nullable\":t",
			"spark.sql.sources.schema.part.1": "rue,\"metadata\":{}},{\"name\":\"WaiversStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"WithdrawalsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}}]}"
		},
		"ObjectVersion": 1,
		"ObjectId": "8a7d182b-3ffd-4864-a49e-74ef1b8efcda",
		"Description": "An agreement for a deposit account with the bank."
	},
	"type": "TABLE"
}