{
	"name": "OnlineAccessAndElectronicFundTransferAgreement",
	"properties": {
		"Name": "OnlineAccessAndElectronicFundTransferAgreement",
		"EntityType": "TABLE",
		"TableType": "EXTERNAL",
		"Namespace": {
			"SchemaName": null,
			"DatabaseName": "ConsumerGoods_vfz",
			"DatabaseId": null
		},
		"StorageDescriptor": {
			"Distribution": null,
			"Columns": [
				{
					"Name": "ContractId",
					"Description": "The unique identifier of a Contract.",
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Length": 0,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "ContractId"
					}
				},
				{
					"Name": "ContractGeneralStatement",
					"Description": "Ex:\n\nThis agreement is a contract that establishes the rules that cover electronic access to your accounts at \"Bank Name\" through Online Banking. \nBy using Online Banking, you accept all the terms and conditions of this Agreement. Please read it carefully. \nThe terms and conditions of the deposit agreements and disclosures, including the Reg E disclosure for all electronic funds transfers, for each of your \"Bank Name\"'s accounts as well as your other agreements such as loans, fees and charges, continue to apply notwithstanding anything to the contrary in this Agreement. \nThis agreement is also subject to applicable federal laws and the laws of the State of Texas. If any provision of this Agreement is found unenforceable according to its terms, all remaining provisions will continue in full force and effect. The headings in this Agreement are for convenience or reference only and will not govern the interpretation of the provisions. Any waiver (express or implied) by either party of any default or breach of this Agreement must be in writing and shall not constitute a waiver of any other or subsequent default or breach. You may not assign this Agreement. This Agreement is binding upon your heirs and \"Bank Name\"'s successors and assigns. Certain of the obligations of the parties pursuant to this Agreement that by their nature would continue beyond the termination, cancellation or expiration of this Agreement.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "ContractGeneralStatement"
					}
				},
				{
					"Name": "DefinitionsStatement",
					"Description": "Ex:\n\nDefinitions. As used in this Agreement, the words \"we\", \"our\", \"us,\" and \"Bank\" mean \"Bank Name\". \"You\" and \"Your\" refer to the accountholder authorized by Bank to use Online Banking under this Agreement and anyone else authorized by that accountholder to exercise control over the accountholder's funds through Online Banking. \"Account\" or \"accounts\" means your accounts at Bank. \"Electronic funds transfers\" means ATM withdrawals, pre-authorized transactions, point of sale transactions, transfers to and from your Bank accounts using Online Banking including bill payments. \"Online Banking services\" means the services provided pursuant to this Agreement, including the bill payment services. \"Business Days\" means Monday through Friday. Federal holidays are not included.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "DefinitionsStatement"
					}
				},
				{
					"Name": "AccessStatement",
					"Description": "Ex:\n\nAccess. To use Online Banking, you must have at least one account with Bank, and access to Internet service. Access to your accounts through Online Banking will be based upon the identification of users and authority levels maintained at the Bank. We undertake no obligation to monitor transactions through Online Banking to determine that they are made on behalf of the accountholder.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "AccessStatement"
					}
				},
				{
					"Name": "OnlineBankingServicesStatement",
					"Description": "Ex:\n\nOnline Banking Services. You can use Online Banking to check the balance of your Bank accounts, transfer funds between your accounts, make stop payment requests, pay bills from your account in the amounts and on the dates you request.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "OnlineBankingServicesStatement"
					}
				},
				{
					"Name": "HoursOfAccessStatement",
					"Description": "Ex:\n\nHours of Access. You can use Online Banking seven days a week, twenty-four hours a day, although some or all Online Banking services may not be available occasionally due to emergency or scheduled system maintenance.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "HoursOfAccessStatement"
					}
				},
				{
					"Name": "PasswordStatement",
					"Description": "Ex:\n\nFor security purposes, you are required to change your password upon your initial first time login to Online Banking. The password, a minimum of 8 digits, maximum of 12 digits, is determined by the accountholder and is not communicated to the Bank. You agree that we are authorized to act on instructions received under your password. You accept responsibility for the confidentiality and security of your password and agree to change your password regularly. After five unsuccessful login attempts, the system locks the user out, requiring either a designated wait period or a phone call to the Bank to reset the password before re-entry into the system. We recommend that you create a unique access ID that utilizes both upper and lowercase alpha and numeric characters for purposes of security. Your password should not be associated with any commonly known personal identification, such as social security numbers, address, dates of birth, names of children, and should be memorized rather than written down.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "PasswordStatement"
					}
				},
				{
					"Name": "SecurityStatement",
					"Description": "Ex:\n\nSecurity. You understand the importance of your role in preventing misuse of your accounts through Online Banking and you agree to promptly examine your paper statement for your Bank accounts as soon as you receive it. You agree to protect the confidentiality of your account and account number, and your personal identification information, such as your driver's license number and social security number. Your password and access ID are intended to provide security against unauthorized entry and access to your accounts. Data transferred via Online Banking is encrypted in an effort to provide transmission security. Once the server session is established, the user and the server are in a secured environment. The server has been certified as a 128-bit encrypted with Secure Sockets Layer (SSL) protocol. With SSL, data that travels between the bank and customer is encrypted and can only be decrypted with the public and private key pair. Requests must filter through a router and firewall before they are permitted to reach the server. A router, a piece of hardware, works in conjunction with the firewall to block and direct traffic coming to the server. Notwithstanding our efforts to insure that Online Banking is secure, you acknowledge that the Internet is inherently insecure and that all data transfers, including electronic mail, occur openly on the Internet and potentially can be read by others.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "SecurityStatement"
					}
				},
				{
					"Name": "TransfersStatement",
					"Description": "Ex:\n\nTransfers. Transfers initiated through Online Banking before 4:00 PM (Central Standard Time) on a business day are posted to your account the same day. Transfers completed after 4:00 PM (Central Standard Time) on a business day will be posted on the next business day. Transfers completed anytime during Saturday, Sunday or banking holiday will be posted on the next business day. Online Banking identifies transfers based upon the login ID of the user who made the electronic transfer. You agree to communicate with any other persons with authorized access to your accounts concerning any transfers or bill payments from your accounts in order to avoid overdrafts. \nFor current bill pay transactions, you will need to have sufficient available funds in that account to cover the amount of the bill payment on the day you initiate the payment, and we will debit your account at that time. If there are not sufficient available funds in the account when we try to debit it, then we may not allow the bill payment to go forward. We will not be liable for any harm that may occur due to delay in notice or in processing. You agree to pay the fee of $5.75 per month for the use of Bill Payment as set forth in the current fee schedule. You agree that such fee shall be deducted from your \"Bank Name\"'s checking account. You agree to pay any additional reasonable charges for services you request which are not covered by this Agreement.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "TransfersStatement"
					}
				},
				{
					"Name": "OverdraftsStatement",
					"Description": "Ex:\n\nOverdrafts. If your account has insufficient funds to perform all electronic fund transfers you have requested for a given business day, then: a. Electronic funds transfers involving current disbursements, like ATM withdrawals, will have priority; b. Electronic fund transfers initiated through Online Banking, which would result in an overdraft of your account, may, at our discretion, are cancelled; c. In the event the electronic fund transfer initiated through Online Banking which would result in an overdraft of your account are not cancelled, overdraft charges may be assessed pursuant to the terms of the deposit agreement for that account. If a hold has been placed on deposits made to an account from which you wish to transfer funds, you cannot transfer the portion of the funds held until the hold expires.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "OverdraftsStatement"
					}
				},
				{
					"Name": "OnlineBankingBillPaymentServicesStatement",
					"Description": "Ex:\n\nOnline Banking Bill Payment Service. You must designate the Bank account from which the payments are to be made; the complete name of the payee, the account number, and the payee's remittance address, all exactly as shown on the billing statement or invoice; the amount of the payment; and the date you want the payment to be debited from your account. If the date you want the payment to be debited from your account is not a business day, your account will be debited the next business day. By using Online Banking bill payment service option, you agree that, based upon instructions received under your password, we can charge your designated account by transfer, or by debiting and remitting funds on your behalf. We reserve the right to refuse to pay any payee designated by you. If we do so, we will notify you promptly.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "OnlineBankingBillPaymentServicesStatement"
					}
				},
				{
					"Name": "SchedulingOnlineBankingPaymentsStatement",
					"Description": "Ex:\n\nScheduling Online Banking Payments. If the payee is to be paid by paper check, you understand and agree that paper checks are mailed to the payee and the payee may not receive the payment until 7 to 10 days after the date the payment is debited from your account. If the payee is to be paid electronically, you understand and agree that the payee may not receive the payment until 2 to 4 days after the date the payment was debited from your account. You understand and agree that we are not responsible for the timely delivery of mail or the improper transmission or handling of payments by a third party such as the failure of the bill payment payee to properly post a payment to your account. \nTo help ensure that your payments arrive on time, you must schedule your payments to be processed at least seven to ten business days before the payment due date. This generally allows sufficient time for the payee to receive and post your payment.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "SchedulingOnlineBankingPaymentsStatement"
					}
				},
				{
					"Name": "StopPaymentRequestsStatement",
					"Description": "Ex:\n\nStop Payment Requests. Stopping the payment of a check is different from the cancellation of a bill payment. Once the bill payment has been debited from your account, you CANNOT cancel or stop a bill payment, which has been paid electronically. You may be able to stop an Online Banking bill payment paid by paper draft by contacting us by telephone or email before the paper draft has cleared. (You will have to contact us by telephone to determine if the paper draft has cleared). If the paper draft has not cleared, we will immediately process your stop-payment request. We will notify you immediately if the paper draft already cleared. To be effective, this type of stop-payment request must precisely identify the name of the payee, the payee-assigned account number and the amount and scheduled dated of the payment. You will incur stop payment charges as disclosed in the current fee-schedule for applicable amount.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "StopPaymentRequestsStatement"
					}
				},
				{
					"Name": "PeriodicStatementsStatement",
					"Description": "Ex:\n\nPeriodic Statements. You will not receive a separate Online Banking statement. Transfers to and from your accounts using Online Banking will appear on the respective paper statements for your bank accounts.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "PeriodicStatementsStatement"
					}
				},
				{
					"Name": "ChangeOfTermsStatement",
					"Description": "Ex:\n\nChange of Terms. We may change any term of this Agreement at any time. If the change would result in increased fees for any Online Banking service, increased liability for you, fewer types of available electronic fund transfers, or stricter limitations on the frequency or dollar amount of transfers, we agree to give you notice at least 21 days before the effective date of any such change, unless an immediate change is necessary to maintain the security of an account or our electronic fund transfer system. We will post any required notice of the change in terms on the Bank website or forward it to you by email or by postal mail. If advanced notice of the change is not required, and disclosure does not jeopardize the security of the account or our electronic fund transfer system, we will notify you of the change in terms within 30 days after the change becomes effective. You acknowledge and agree that changes to fees applicable to specific accounts are governed by the applicable deposit agreements and disclosures.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "ChangeOfTermsStatement"
					}
				},
				{
					"Name": "ErrorsStatement",
					"Description": "Ex:\n\nIn Case of Errors or Questions about Your Electronic Transfers. Contact us as soon as you can, if you think your paper statement is wrong, or if you need more information about a transfer listed on your paper statement. We must hear from you no later than 60 days after we sent the FIRST paper statement upon which the problem or error appeared. When you contact us:\n1. Tell us your name and account number. \n2. Describe the error or transfer you are unsure about, and explain as clearly as you can why you believe it is an error, or why you need more information. \n3. Tell us the dollar amount of the suspected error. \n4. If the suspected error relates to a bill payment, tell us the account number used to pay the bill, payee name, the date the payment was made and payment amount. \n5. If you contact us by telephone or by email, we may require that you send us your complaint or question in the form of a paper writing by postal mail or fax within 10 business days. We will communicate to you the results of our investigation within 10 business days after you contact us and will correct any error promptly. If we need more time, however, we may take up to 45 days to investigate your complaint or question and provide provisional credit for the amount in dispute. \n6. If we decide that there was no error, we will send you a written explanation within 3 business days after we finish our investigation. You may ask for copies of the documents that we used in our investigation. If we have made a provisional credit, a corresponding debit will be made from your account. \n7. For errors involving foreign-initiated transactions, we may take up to ninety (90) days to investigate your complaint.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "ErrorsStatement"
					}
				},
				{
					"Name": "BankTransferLiabilityStatement",
					"Description": "Ex:\n\nOur Liability for Failure to Make a Transfer. If we do not complete a transfer to or from your account, including a bill payment, on time or in the correct amount, according to our agreement with you when you have properly instructed us to do so, we will be liable to you for your losses or damages caused as a result. However, there are some exceptions. We will not be liable, for instance:\n1. If through no fault of ours, you do not have enough money in your account to make a transfer \n2. If a legal order directs us to prohibit withdrawals from the account \n3. If you account is closed, or if it has to be frozen \n4. If the transfer would cause your balance to go over the credit limit of an established line of credit or the credit limit for any credit arrangement set up to cover overdrafts \n5. If you, or anyone authorized by you, commits any fraud or violates any law or regulation \n6. If any electronic terminal, telecommunication device, or any part of Online Banking electronic fund transfer system is not working properly and you know about the problem when you started the transfer \n7. If you have not provided us with complete and correct payment information for the Bill Payment service, including without limitation, the name, address, your payee-assigned account number, payment date and payment amount for the payee on a bill payment \n8. If you have not properly followed the on-screen instructions for using Online Banking \n9. If circumstances beyond our control (such as fire, flood, interruption in telephone service or other communication lines) prevent the transfer, despite reasonable precautions that we may have taken",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "BankTransferLiabilityStatement"
					}
				},
				{
					"Name": "CustomerLiabilityStatement",
					"Description": "Ex:\n\nYour Liability for Unauthorized Transfers. Contact us at once if you believe your password has been lost, or stolen, used without your authorization, or otherwise compromised, or if someone has transferred or may transfer money from your accounts without your permission. An immediate telephone call to us is the best way to reduce any possible losses.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "CustomerLiabilityStatement"
					}
				},
				{
					"Name": "DisclaimerOfWarrantyStatement",
					"Description": "Ex:\n\nDisclaimer of Warranty and Limitation of Liability. We make no warranty of any kind, expressed or implied, including any implied warranty of merchantability or fitness for a particular purpose, in connection with the Online Banking services provided to you under this Agreement. We do not and cannot warrant that Online Banking will operate without errors, or that any or all Online Banking Services will be available and operational at all times. Except as specifically provided in this Agreement, or otherwise required by law, you agree that our officers, directors, employees, agents or contractors are not liable for any indirect, incidental, special or consequential damages under or by reason of any services or products provided under this Agreement or by reason of your use of or access to Online Banking, including loss of profits, revenue, data or use by you or any third party, whether in an action in contract or tort or based on a warranty. Further, in no event shall the liability of \"Bank Name\" exceed the amount paid by you for the services provided to you through Online Banking. \nYou are responsible for obtaining, installing, maintaining and operation all computer hardware and software necessary for Online Banking and Bill Pay. The Bank will not be responsible for any errors or failures from the malfunction or failure of your hardware or software.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "DisclaimerOfWarrantyStatement"
					}
				},
				{
					"Name": "ConfidentialityStatement",
					"Description": "Ex:\n\nConfidentiality. We will disclose information to third parties about your account or the transfers you make:\n1. To complete transfers as necessary; \n2. To verify the existence and condition of your account upon the request of a third party, such as a credit bureau or merchant; or \n3. To comply with government agency or court orders; or \n4. If you give us your written permission",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "ConfidentialityStatement"
					}
				},
				{
					"Name": "RightToTerminateStatement",
					"Description": "Ex:\n\nOur Right to Terminate. You agree that we can terminate or limit your access to Online Banking for any of the following reasons:\n1. Without prior notice, if you have insufficient funds in any one of your Bank accounts. Online Banking service may be reinstated, at our sole discretion, once sufficient funds are available to cover any fees, pending transfers, and debits. \n2. Upon 3-business days notice, if you do not contact us to designate a new Primary Checking Account immediately after you close your checking account. \n3. Upon reasonable notice, for any other reason at our sole discretion.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "RightToTerminateStatement"
					}
				},
				{
					"Name": "GeneralStatement",
					"Description": "Ex:\n\nGeneral. This Agreement is intended to supplement and not to replace other agreements between you and us relating to your accounts. In the event of a conflict between this Agreement and any other account rules and agreements that apply to your accounts, this Agreement shall govern and prevail.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "GeneralStatement"
					}
				},
				{
					"Name": "ElectronicMessagesStatement",
					"Description": "Ex:\n\nElectronic messages from you to us, or from us to you, will be treated as written documents for any purpose a written document is needed. However, we can require written confirmation of messages or instructions if we choose, and may delay any executing transactions until we receive confirmation acceptable to us. We might do this, for example, if we think it will help protect you or us from fraud or a loss, but we can do so in other circumstances.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement",
						"Name": "ElectronicMessagesStatement"
					}
				}
			],
			"ColumnSetEntityName": "6dba1461-7185-47c6-86a1-01e973c44b8d",
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://workspace@jam710adls.dfs.core.windows.net/ConsumerGoods_vfz/OnlineAccessAndElectronicFundTransferAgreement",
					"delimiter": ",",
					"firstRowAsHeader": "false",
					"multiLine": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://workspace@jam710adls.dfs.core.windows.net/ConsumerGoods_vfz/OnlineAccessAndElectronicFundTransferAgreement",
				"Properties": {
					"LinkedServiceName": "synapsedemojamesbas-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ContractId\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ContractId\"},\"ContractGeneralStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ContractGeneralStatement\"},\"DefinitionsStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"DefinitionsStatement\"},\"AccessStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"AccessStatement\"},\"OnlineBankingServicesStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"OnlineBankingServicesStatement\"},\"HoursOfAccessStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"HoursOfAccessStatement\"},\"PasswordStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"PasswordStatement\"},\"SecurityStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"SecurityStatement\"},\"TransfersStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"TransfersStatement\"},\"OverdraftsStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"OverdraftsStatement\"},\"OnlineBankingBillPaymentServicesStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"OnlineBankingBillPaymentServicesStatement\"},\"SchedulingOnlineBankingPaymentsStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"SchedulingOnlineBankingPaymentsStatement\"},\"StopPaymentRequestsStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"StopPaymentRequestsStatement\"},\"PeriodicStatementsStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"PeriodicStatementsStatement\"},\"ChangeOfTermsStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ChangeOfTermsStatement\"},\"ErrorsStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ErrorsStatement\"},\"BankTransferLiabilityStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"BankTransferLiabilityStatement\"},\"CustomerLiabilityStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"CustomerLiabilityStatement\"},\"DisclaimerOfWarrantyStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"DisclaimerOfWarrantyStatement\"},\"ConfidentialityStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ConfidentialityStatement\"},\"RightToTerminateStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"RightToTerminateStatement\"},\"GeneralStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"GeneralStatement\"},\"ElectronicMessagesStatement\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ElectronicMessagesStatement\"}}}"
			},
			"Compressed": false,
			"SerDeInfo": null,
			"IsStoredAsSubdirectories": false
		},
		"Owner": null,
		"CreateTime": 0,
		"LastAccessTime": 0,
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false,
		"ViewOriginalText": null,
		"ViewExpandedText": null,
		"Origin": {
			"Type": "SPARK"
		},
		"OriginObjectId": null,
		"IsSharedEntity": false,
		"PublishStatus": "PUBLISHED",
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"OnlineAccessAndElectronicFundTransferAgreement\",\"path\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\"},\"description\":\"An agreement for online access and electronic funds transfers with the Bank.\",\"primaryKey\":[\"ContractId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ContractId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Contract.\",\"isNullable\":false,\"name\":\"ContractId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ContractGeneralStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nThis agreement is a contract that establishes the rules that cover electronic access to your accounts at \\\"Bank Name\\\" through Online Banking. \\nBy using Online Banking, you accept all the terms and conditions of this Agreement. Please read it carefully. \\nThe terms and conditions of the deposit agreements and disclosures, including the Reg E disclosure for all electronic funds transfers, for each of your \\\"Bank Name\\\"'s accounts as well as your other agreements such as loans, fees and charges, continue to apply notwithstanding anything to the contrary in this Agreement. \\nThis agreement is also subject to applicable federal laws and the laws of the State of Texas. If any provision of this Agreement is found unenforceable according to its terms, all remaining provisions will continue in full force and effect. The headings in this Agreement are for convenience or reference only and will not govern the interpretation of the provisions. Any waiver (express or implied) by either party of any default or breach of this Agreement must be in writing and shall not constitute a waiver of any other or subsequent default or breach. You may not assign this Agreement. This Agreement is binding upon your heirs and \\\"Bank Name\\\"'s successors and assigns. Certain of the obligations of the parties pursuant to this Agreement that by their nature would continue beyond the termination, cancellation or expiration of this Agreement.\",\"isNullable\":true,\"name\":\"ContractGeneralStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"DefinitionsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nDefinitions. As used in this Agreement, the words \\\"we\\\", \\\"our\\\", \\\"us,\\\" and \\\"Bank\\\" mean \\\"Bank Name\\\". \\\"You\\\" and \\\"Your\\\" refer to the accountholder authorized by Bank to use Online Banking under this Agreement and anyone else authorized by that accountholder to exercise control over the accountholder's funds through Online Banking. \\\"Account\\\" or \\\"accounts\\\" means your accounts at Bank. \\\"Electronic funds transfers\\\" means ATM withdrawals, pre-authorized transactions, point of sale transactions, transfers to and from your Bank accounts using Online Banking including bill payments. \\\"Online Banking services\\\" means the services provided pursuant to this Agreement, including the bill payment services. \\\"Business Days\\\" means Monday through Friday. Federal holidays are not included.\",\"isNullable\":true,\"name\":\"DefinitionsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"AccessStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nAccess. To use Online Banking, you must have at least one account with Bank, and access to Internet service. Access to your accounts through Online Banking will be based upon the identification of users and authority levels maintained at the Bank. We undertake no obligation to monitor transactions through Online Banking to determine that they are made on behalf of the accountholder.\",\"isNullable\":true,\"name\":\"AccessStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"OnlineBankingServicesStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nOnline Banking Services. You can use Online Banking to check the balance of your Bank accounts, transfer funds between your accounts, make stop payment requests, pay bills from your account in the amounts and on the dates you request.\",\"isNullable\":true,\"name\":\"OnlineBankingServicesStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"HoursOfAccessStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nHours of Access. You can use Online Banking seven days a week, twenty-four hours a day, although some or all Online Banking services may not be available occasionally due to emergency or scheduled system maintenance.\",\"isNullable\":true,\"name\":\"HoursOfAccessStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"PasswordStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nFor security purposes, you are required to change your password upon your initial first time login to Online Banking. The password, a minimum of 8 digits, maximum of 12 digits, is determined by the accountholder and is not communicated to the Bank. You agree that we are authorized to act on instructions received under your password. You accept responsibility for the confidentiality and security of your password and agree to change your password regularly. After five unsuccessful login attempts, the system locks the user out, requiring either a designated wait period or a phone call to the Bank to reset the password before re-entry into the system. We recommend that you create a unique access ID that utilizes both upper and lowercase alpha and numeric characters for purposes of security. Your password should not be associated with any commonly known personal identification, such as social security numbers, address, dates of birth, names of children, and should be memorized rather than written down.\",\"isNullable\":true,\"name\":\"PasswordStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"SecurityStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nSecurity. You understand the importance of your role in preventing misuse of your accounts through Online Banking and you agree to promptly examine your paper statement for your Bank accounts as soon as you receive it. You agree to protect the confidentiality of your account and account number, and your personal identification information, such as your driver's license number and social security number. Your password and access ID are intended to provide security against unauthorized entry and access to your accounts. Data transferred via Online Banking is encrypted in an effort to provide transmission security. Once the server session is established, the user and the server are in a secured environment. The server has been certified as a 128-bit encrypted with Secure Sockets Layer (SSL) protocol. With SSL, data that travels between the bank and customer is encrypted and can only be decrypted with the public and private key pair. Requests must filter through a router and firewall before they are permitted to reach the server. A router, a piece of hardware, works in conjunction with the firewall to block and direct traffic coming to the server. Notwithstanding our efforts to insure that Online Banking is secure, you acknowledge that the Internet is inherently insecure and that all data transfers, including electronic mail, occur openly on the Internet and potentially can be read by others.\",\"isNullable\":true,\"name\":\"SecurityStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"TransfersStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nTransfers. Transfers initiated through Online Banking before 4:00 PM (Central Standard Time) on a business day are posted to your account the same day. Transfers completed after 4:00 PM (Central Standard Time) on a business day will be posted on the next business day. Transfers completed anytime during Saturday, Sunday or banking holiday will be posted on the next business day. Online Banking identifies transfers based upon the login ID of the user who made the electronic transfer. You agree to communicate with any other persons with authorized access to your accounts concerning any transfers or bill payments from your accounts in order to avoid overdrafts. \\nFor current bill pay transactions, you will need to have sufficient available funds in that account to cover the amount of the bill payment on the day you initiate the payment, and we will debit your account at that time. If there are not sufficient available funds in the account when we try to debit it, then we may not allow the bill payment to go forward. We will not be liable for any harm that may occur due to delay in notice or in processing. You agree to pay the fee of $5.75 per month for the use of Bill Payment as set forth in the current fee schedule. You agree that such fee shall be deducted from your \\\"Bank Name\\\"'s checking account. You agree to pay any additional reasonable charges for services you request which are not covered by this Agreement.\",\"isNullable\":true,\"name\":\"TransfersStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"OverdraftsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nOverdrafts. If your account has insufficient funds to perform all electronic fund transfers you have requested for a given business day, then: a. Electronic funds transfers involving current disbursements, like ATM withdrawals, will have priority; b. Electronic fund transfers initiated through Online Banking, which would result in an overdraft of your account, may, at our discretion, are cancelled; c. In the event the electronic fund transfer initiated through Online Banking which would result in an overdraft of your account are not cancelled, overdraft charges may be assessed pursuant to the terms of the deposit agreement for that account. If a hold has been placed on deposits made to an account from which you wish to transfer funds, you cannot transfer the portion of the funds held until the hold expires.\",\"isNullable\":true,\"name\":\"OverdraftsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"OnlineBankingBillPaymentServicesStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nOnline Banking Bill Payment Service. You must designate the Bank account from which the payments are to be made; the complete name of the payee, the account number, and the payee's remittance address, all exactly as shown on the billing statement or invoice; the amount of the payment; and the date you want the payment to be debited from your account. If the date you want the payment to be debited from your account is not a business day, your account will be debited the next business day. By using Online Banking bill payment service option, you agree that, based upon instructions received under your password, we can charge your designated account by transfer, or by debiting and remitting funds on your behalf. We reserve the right to refuse to pay any payee designated by you. If we do so, we will notify you promptly.\",\"isNullable\":true,\"name\":\"OnlineBankingBillPaymentServicesStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"SchedulingOnlineBankingPaymentsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nScheduling Online Banking Payments. If the payee is to be paid by paper check, you understand and agree that paper checks are mailed to the payee and the payee may not receive the payment until 7 to 10 days after the date the payment is debited from your account. If the payee is to be paid electronically, you understand and agree that the payee may not receive the payment until 2 to 4 days after the date the payment was debited from your account. You understand and agree that we are not responsible for the timely delivery of mail or the improper transmission or handling of payments by a third party such as the failure of the bill payment payee to properly post a payment to your account. \\nTo help ensure that your payments arrive on time, you must schedule your payments to be processed at least seven to ten business days before the payment due date. This generally allows sufficient time for the payee to receive and post your payment.\",\"isNullable\":true,\"name\":\"SchedulingOnlineBankingPaymentsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"StopPaymentRequestsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nStop Payment Requests. Stopping the payment of a check is different from the cancellation of a bill payment. Once the bill payment has been debited from your account, you CANNOT cancel or stop a bill payment, which has been paid electronically. You may be able to stop an Online Banking bill payment paid by paper draft by contacting us by telephone or email before the paper draft has cleared. (You will have to contact us by telephone to determine if the paper draft has cleared). If the paper draft has not cleared, we will immediately process your stop-payment request. We will notify you immediately if the paper draft already cleared. To be effective, this type of stop-payment request must precisely identify the name of the payee, the payee-assigned account number and the amount and scheduled dated of the payment. You will incur stop payment charges as disclosed in the current fee-schedule for applicable amount.\",\"isNullable\":true,\"name\":\"StopPaymentRequestsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"PeriodicStatementsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nPeriodic Statements. You will not receive a separate Online Banking statement. Transfers to and from your accounts using Online Banking will appear on the respective paper statements for your bank accounts.\",\"isNullable\":true,\"name\":\"PeriodicStatementsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ChangeOfTermsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nChange of Terms. We may change any term of this Agreement at any time. If the change would result in increased fees for any Online Banking service, increased liability for you, fewer types of available electronic fund transfers, or stricter limitations on the frequency or dollar amount of transfers, we agree to give you notice at least 21 days before the effective date of any such change, unless an immediate change is necessary to maintain the security of an account or our electronic fund transfer system. We will post any required notice of the change in terms on the Bank website or forward it to you by email or by postal mail. If advanced notice of the change is not required, and disclosure does not jeopardize the security of the account or our electronic fund transfer system, we will notify you of the change in terms within 30 days after the change becomes effective. You acknowledge and agree that changes to fees applicable to specific accounts are governed by the applicable deposit agreements and disclosures.\",\"isNullable\":true,\"name\":\"ChangeOfTermsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ErrorsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nIn Case of Errors or Questions about Your Electronic Transfers. Contact us as soon as you can, if you think your paper statement is wrong, or if you need more information about a transfer listed on your paper statement. We must hear from you no later than 60 days after we sent the FIRST paper statement upon which the problem or error appeared. When you contact us:\\n1. Tell us your name and account number. \\n2. Describe the error or transfer you are unsure about, and explain as clearly as you can why you believe it is an error, or why you need more information. \\n3. Tell us the dollar amount of the suspected error. \\n4. If the suspected error relates to a bill payment, tell us the account number used to pay the bill, payee name, the date the payment was made and payment amount. \\n5. If you contact us by telephone or by email, we may require that you send us your complaint or question in the form of a paper writing by postal mail or fax within 10 business days. We will communicate to you the results of our investigation within 10 business days after you contact us and will correct any error promptly. If we need more time, however, we may take up to 45 days to investigate your complaint or question and provide provisional credit for the amount in dispute. \\n6. If we decide that there was no error, we will send you a written explanation within 3 business days after we finish our investigation. You may ask for copies of the documents that we used in our investigation. If we have made a provisional credit, a corresponding debit will be made from your account. \\n7. For errors involving foreign-initiated transactions, we may take up to ninety (90) days to investigate your complaint.\",\"isNullable\":true,\"name\":\"ErrorsStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"BankTransferLiabilityStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nOur Liability for Failure to Make a Transfer. If we do not complete a transfer to or from your account, including a bill payment, on time or in the correct amount, according to our agreement with you when you have properly instructed us to do so, we will be liable to you for your losses or damages caused as a result. However, there are some exceptions. We will not be liable, for instance:\\n1. If through no fault of ours, you do not have enough money in your account to make a transfer \\n2. If a legal order directs us to prohibit withdrawals from the account \\n3. If you account is closed, or if it has to be frozen \\n4. If the transfer would cause your balance to go over the credit limit of an established line of credit or the credit limit for any credit arrangement set up to cover overdrafts \\n5. If you, or anyone authorized by you, commits any fraud or violates any law or regulation \\n6. If any electronic terminal, telecommunication device, or any part of Online Banking electronic fund transfer system is not working properly and you know about the problem when you started the transfer \\n7. If you have not provided us with complete and correct payment information for the Bill Payment service, including without limitation, the name, address, your payee-assigned account number, payment date and payment amount for the payee on a bill payment \\n8. If you have not properly followed the on-screen instructions for using Online Banking \\n9. If circumstances beyond our control (such as fire, flood, interruption in telephone service or other communication lines) prevent the transfer, despite reasonable precautions that we may have taken\",\"isNullable\":true,\"name\":\"BankTransferLiabilityStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"CustomerLiabilityStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nYour Liability for Unauthorized Transfers. Contact us at once if you believe your password has been lost, or stolen, used without your authorization, or otherwise compromised, or if someone has transferred or may transfer money from your accounts without your permission. An immediate telephone call to us is the best way to reduce any possible losses.\",\"isNullable\":true,\"name\":\"CustomerLiabilityStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"DisclaimerOfWarrantyStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nDisclaimer of Warranty and Limitation of Liability. We make no warranty of any kind, expressed or implied, including any implied warranty of merchantability or fitness for a particular purpose, in connection with the Online Banking services provided to you under this Agreement. We do not and cannot warrant that Online Banking will operate without errors, or that any or all Online Banking Services will be available and operational at all times. Except as specifically provided in this Agreement, or otherwise required by law, you agree that our officers, directors, employees, agents or contractors are not liable for any indirect, incidental, special or consequential damages under or by reason of any services or products provided under this Agreement or by reason of your use of or access to Online Banking, including loss of profits, revenue, data or use by you or any third party, whether in an action in contract or tort or based on a warranty. Further, in no event shall the liability of \\\"Bank Name\\\" exceed the amount paid by you for the services provided to you through Online Banking. \\nYou are responsible for obtaining, installing, maintaining and operation all computer hardware and software necessary for Online Banking and Bill Pay. The Bank will not be responsible for any errors or failures from the malfunction or failure of your hardware or software.\",\"isNullable\":true,\"name\":\"DisclaimerOfWarrantyStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ConfidentialityStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nConfidentiality. We will disclose information to third parties about your account or the transfers you make:\\n1. To complete transfers as necessary; \\n2. To verify the existence and condition of your account upon the request of a third party, such as a credit bureau or merchant; or \\n3. To comply with government agency or court orders; or \\n4. If you give us your written permission\",\"isNullable\":true,\"name\":\"ConfidentialityStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"RightToTerminateStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nOur Right to Terminate. You agree that we can terminate or limit your access to Online Banking for any of the following reasons:\\n1. Without prior notice, if you have insufficient funds in any one of your Bank accounts. Online Banking service may be reinstated, at our sole discretion, once sufficient funds are available to cover any fees, pending transfers, and debits. \\n2. Upon 3-business days notice, if you do not contact us to designate a new Primary Checking Account immediately after you close your checking account. \\n3. Upon reasonable notice, for any other reason at our sole discretion.\",\"isNullable\":true,\"name\":\"RightToTerminateStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"GeneralStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nGeneral. This Agreement is intended to supplement and not to replace other agreements between you and us relating to your accounts. In the event of a conflict between this Agreement and any other account rules and agreements that apply to your accounts, this Agreement shall govern and prevail.\",\"isNullable\":true,\"name\":\"GeneralStatement\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"OnlineAccessAndElectronicFundTransferAgreement.cdm.json/OnlineAccessAndElectronicFundTransferAgreement\",\"name\":\"ElectronicMessagesStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"Ex:\\n\\nElectronic messages from you to us, or from us to you, will be treated as written documents for any purpose a written document is needed. However, we can require written confirmation of messages or instructions if we choose, and may delay any executing transactions until we receive confirmation acceptable to us. We might do this, for example, if we think it will help protect you or us from fraud or a loss, but we can do so in other circumstances.\",\"isNullable\":true,\"name\":\"ElectronicMessagesStatement\"}]}}}",
			"Description": "An agreement for online access and electronic funds transfers with the Bank.",
			"DisplayFolderInfo": "{\"name\":\"Contract\",\"colorCode\":\"#000F5C\"}",
			"PrimaryKeys": "ContractId",
			"spark.sql.sources.provider": "csv",
			"x-ms-usageinfo": "AzureSynapseDatabaseTemplate",
			"spark.sql.sources.schema.numParts": "1",
			"spark.sql.sources.schema.part.0": "{\"type\":\"struct\",\"fields\":[{\"name\":\"ContractId\",\"type\":\"integer\",\"nullable\":false,\"metadata\":{}},{\"name\":\"ContractGeneralStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"DefinitionsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"AccessStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"OnlineBankingServicesStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"HoursOfAccessStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"PasswordStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"SecurityStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"TransfersStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"OverdraftsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"OnlineBankingBillPaymentServicesStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"SchedulingOnlineBankingPaymentsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"StopPaymentRequestsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"PeriodicStatementsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ChangeOfTermsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ErrorsStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"BankTransferLiabilityStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"CustomerLiabilityStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"DisclaimerOfWarrantyStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ConfidentialityStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"RightToTerminateStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"GeneralStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"ElectronicMessagesStatement\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}}]}"
		},
		"ObjectVersion": 1,
		"ObjectId": "b04f0235-d7d0-413b-853e-c2b574c7f058",
		"Description": "An agreement for online access and electronic funds transfers with the Bank."
	},
	"type": "TABLE"
}