{
	"name": "PartyLifestyleGroup",
	"properties": {
		"Name": "PartyLifestyleGroup",
		"EntityType": "TABLE",
		"TableType": "EXTERNAL",
		"Namespace": {
			"SchemaName": null,
			"DatabaseName": "ConsumerGoods_vfz",
			"DatabaseId": null
		},
		"StorageDescriptor": {
			"Distribution": null,
			"Columns": [
				{
					"Name": "PartyId",
					"Description": "The unique identifier of a Party.",
					"OriginDataTypeName": {
						"TypeName": "long",
						"IsComplexType": false,
						"IsNullable": false,
						"Length": 0,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "long"
						}
					},
					"BaseAttributeReference": {
						"Entity": "PartyLifestyleGroup.cdm.json/PartyLifestyleGroup",
						"Name": "PartyId"
					}
				},
				{
					"Name": "LifestyleGroupId",
					"Description": "The unique identifier of a Lifestyle Group.",
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Length": 0,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					},
					"BaseAttributeReference": {
						"Entity": "PartyLifestyleGroup.cdm.json/PartyLifestyleGroup",
						"Name": "LifestyleGroupId"
					}
				},
				{
					"Name": "PeriodStartDate",
					"Description": "The period start date for which the associated data is effective or 'as-of'.",
					"OriginDataTypeName": {
						"TypeName": "date",
						"IsComplexType": false,
						"IsNullable": false,
						"Length": 0,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"DateFormat": "YYYY-MM-DD",
							"HIVE_TYPE_STRING": "date"
						}
					},
					"BaseAttributeReference": {
						"Entity": "PartyLifestyleGroup.cdm.json/PartyLifestyleGroup",
						"Name": "PeriodStartDate"
					}
				},
				{
					"Name": "PeriodEndDate",
					"Description": "The period end date for which the associated data is effective or 'as-of'.",
					"OriginDataTypeName": {
						"TypeName": "date",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 0,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"DateFormat": "YYYY-MM-DD",
							"HIVE_TYPE_STRING": "date"
						}
					},
					"BaseAttributeReference": {
						"Entity": "PartyLifestyleGroup.cdm.json/PartyLifestyleGroup",
						"Name": "PeriodEndDate"
					}
				},
				{
					"Name": "PartyLifestyleGroupNote",
					"Description": "A note, comment or additional information regarding the Party Lifestyle Group relationship.",
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Precision": 0,
						"Scale": 0,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					},
					"BaseAttributeReference": {
						"Entity": "PartyLifestyleGroup.cdm.json/PartyLifestyleGroup",
						"Name": "PartyLifestyleGroupNote"
					}
				}
			],
			"ColumnSetEntityName": "d4cc557a-e6e5-4965-96bd-cfe4f7dfae4f",
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://workspace@jam710adls.dfs.core.windows.net/ConsumerGoods_vfz/PartyLifestyleGroup",
					"delimiter": ",",
					"firstRowAsHeader": "false",
					"multiLine": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://workspace@jam710adls.dfs.core.windows.net/ConsumerGoods_vfz/PartyLifestyleGroup",
				"Properties": {
					"LinkedServiceName": "synapsedemojamesbas-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"PartyId\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PartyId\"},\"LifestyleGroupId\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"LifestyleGroupId\"},\"PeriodStartDate\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PeriodStartDate\"},\"PeriodEndDate\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PeriodEndDate\"},\"PartyLifestyleGroupNote\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PartyLifestyleGroupNote\"}}}"
			},
			"Compressed": false,
			"SerDeInfo": null,
			"IsStoredAsSubdirectories": false
		},
		"Owner": null,
		"CreateTime": 0,
		"LastAccessTime": 0,
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false,
		"ViewOriginalText": null,
		"ViewExpandedText": null,
		"Origin": {
			"Type": "SPARK"
		},
		"OriginObjectId": null,
		"IsSharedEntity": false,
		"PublishStatus": "PUBLISHED",
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"PartyLifestyleGroup\",\"path\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\"},\"description\":\"The Party Lifestyle Group characteristic.\\n\\nThese criteria can change over a period of time and are represented with 'period start date/period end date' qualifications, which represented the best case for knowing this information.    If the data is only randomly sampled or recorded then you could use a single 'date' to identify its recording or effective as-of date.\\n\\nA classification of American consumers created by SRI International.\\n\\nThis classification defines nine lifestyle groups describing general personality traits and patterns of living.\\n\\n\\\"VALS is a marketing and consulting tool that helps businesses worldwide develop and execute more effective strategies. The system identifies current and future opportunities by segmenting the consumer marketplace on the basis of the personality traits that drive consumer behavior. VALS applies in all phases of the marketing process, from new-product development and entry-stage targeting to communications strategy and advertising.    The basic tenet of VALS is that people express their personalities through their behaviors. VALS specifically defines consumer segments on the basis of those personality traits that affect behavior in the marketplace. Rather than looking at what people do and segregating people with like activities, VALS uses psychology to segment people according to their distinct personality traits. The personality traits are the motivation-the cause. Buying behavior becomes the effect-the observable, external behavior prompted by an internal driver.\\n\\nAbout VALS™\\n\\nVALS reflects a real-world pattern that explains the relationship between personality traits and consumer behavior. VALS uses psychology to analyze the dynamics underlying consumer preferences and choices. VALS not only distinguishes differences in motivation, it also captures the psychological and material constraints on consumer behavior.\\n\\nVALS is based on current personality research into specific components of social behavior. VALS asserts that people express their personalities through their behaviors. People with different personalities engage in different behaviors or exhibit similar behaviors for different reasons\\n\\nHistory\\n\\nThe original VALS system was built by consumer futurist Arnold Mitchell. Mitchell created VALS to explain changing U.S. values and lifestyles in the 1970s. VALS was formally inaugurated as an SRI International product in 1978 and was cited by Advertising Age as \\\"one of the ten top market research breakthroughs of the 1980s.\\\"\\n\\nIn 1989, VALS was redefined to maximize its ability to predict consumer behavior. A team of experts from SRI International, Stanford University, and the University of California, Berkeley, determined that consumers should be segmented on the basis of enduring personality traits rather than social values that change over time.\\n\\nBy using psychology to analyze and predict consumer preferences and choices, the current VALS system creates an explicit link between personality traits and purchase behavior..\\n\\nYour VALS™ Type in Context\\n\\nEach of us is an individual. Yet each of us also has personality traits, attitudes, or needs that are similar to those of other people. VALS™ measures the underlying psychological motivations and resources that many consumers share that predict each group's typical choices as consumers. On this basis, we present you with information about your VALS type.\\n\\nYou may find that some of the details in your VALS description are not like you at all. But don't judge too quickly. The details that are literally unlike you may identify a basic tendency that you express in some other way. Your VALS type implies that you will share many attributes with others of the same type. It does not imply that you will resemble them in all your behavior. The description that we provide you should form an overall portrait that, as a whole, reflects you as an individual fairly well.\\n\\nPrimary Motivation\\nConsumers buy products and services and seek experiences that fulfill their characteristic preferences and give shape, substance, and satisfaction to their lives. An individual's primary motivation determines what in particular about the self or the world is the meaningful core that governs his or her activities. Consumers are inspired by one of three primary motivations: ideals, achievement, and self-expression. Consumers who are primarily motivated by ideals are guided by knowledge and principles. Consumers who are primarily motivated by achievement look for products and services that demonstrate success to their peers. Consumers who are primarily motivated by self-expression desire social or physical activity, variety, and risk.\\n\\nResources\\nA person's tendency to consume goods and services extends beyond age, income, and education. Energy, self-confidence, intellectualism, novelty seeking, innovativeness, impulsiveness, leadership, and vanity play a critical role. These personality traits in conjunction with key demographics determine an individual's resources. Different levels of resources enhance or constrain a person's expression of his or her primary motivation.\\n\\nVALS links global strategies to local efforts through GeoVALS.\\n\\nPenetrate beneath superficial geodemographic similarities.\\n\\nGeoVALS applies the power of VALS to local marketing initiatives by identifying the concentration of the VALS consumer groups residing within a specific block group or ZIP code. GeoVALS provides the flexibility to manipulate data by block group, ZIP code, post office, county, state, DMA, or customized aggregates of ZIP codes.\\n\\nUse GeoVALS for:\\n \\n \\n-  Direct Marketing\\nIncrease hit rates by identifying those ZIP codes with the highest proportion of your target.\\n\\n-  Sales Analysis\\nEstimate the sales potential and analyze sales performance by region.\\n\\n-  Site Location\\nSelect locations for retail outlets based on concentrations of target customers.\\n\\n-  Merchandise Mix\\nCritique and refine merchandise mix based on the consumers within a trading area.\\n\\n-  Media Analysis\\nTailor programming format and content to audience composition.\\n\\nVALS - Applications\\n\\nCommercialization\\n\\nVALS - facilitates successful product launches and helps avoid costly mistakes. Understanding the needs of different consumer groups guides new product and services development.\\n \\n-  Ideation\\nBrainstorm new product ideas, business models, and future scenarios.\\n\\n-  Entry-Stage Targeting\\nIdentify if a market exists for a product or service, then size the market.\\n\\n-  Concept Testing\\nValidate the potential of new ideas among people most likely to buy.\\n\\n-  Focus Groups\\nRecruit focus groups based on people with like motivations to capture clearer insight.\\n\\n-  Features and Benefits\\n\\nDesign features and benefits to appeal to innovators and early adopters.\\n\\n-  Business Partnerships\\nEvaluate which business partners will prove to be the best match.\\n\\n-  Distribution Channel\\nSelect the most appropriate distribution channels or retail outlets.\\n\\nPositioning\\n\\nVALS identifies which market opportunities are strongest. Relating features and benefits to distinct segment needs clarifies strategies for targeting and expansion.\\n \\n-  Competitive Analysis\\nLocate core customers and competitors.\\n\\n-  Brand Differentiation\\nUnderstand the motivation behind a purchase decision to ascertain key points of differentiation among brands.\\n\\n-  Customer Retention\\nEvaluate the relative opportunity between current and potential customers and design effective retention strategies for core customers.\\n\\n-  Proprietary Research\\nInclude the VALS survey in proprietary research studies to magnify learning.\\n\\n-  Bridge Data Sets\\nCreate a bridge to other research studies that have included VALS.\\n\\n-  Product Life Cycle\\nTrack and manage brand profitability by including VALS in ongoing studies.\\n\\nCommunications\\n\\nVALS shows you how to craft more effective messaging campaigns. Understanding what motivates consumers illuminates how to speak to them in ways that will initiate action.\\n\\n-  Selling Proposition\\nDefine more compelling selling propositions linked to enduring motivations.\\n\\n-  Brand Personality\\nNurture an attractive brand personality by understanding consumer preferences.\\n\\n-  Creative Development\\nUse language and images that resonate with each segment.\\n\\n-  Message Placement\\nEvaluate opportunities for message placement \\n\\n-  Media Preferences\\nSelect media with larger audiences of the desired target.\\n\\\"\\n\\nThis classification suggests that consumers move through the various groups in different stages of their lives.  Each stage affects the individual's attitudes, behavior and psychological needs.\\n\\nSRI International provides lifestyle group data to subscribers, which can then be used to formulate product and marketing strategies.\\n\\nVALS - short for values and lifestyles - is a way of viewing people on the basis of their attitudes, needs, wants, beliefs, and demographics. The VALS program was created by SRI International in 1978 in an attempt to \\\"put people\\\" into the thinking of those of us trying to understand the trends of our times - in the marketplace, economically, politically, sociologically, and humanly. The approach is holistic, drawing on insight and many sources of data to develop a comprehensive framework for characterizing the ways of life of Americans. \\n\\nA basic tool of the VALS program is the VALS typology. \\n\\nThis typology is divided into four major categories, with a total of eight types:\\n\\n- Innovators\\n- Thinkers\\n- Achievers\\n- Experiencers\\n- Believers\\n- Strivers\\n- Makers\\n- Survivors\\n\\nInnovators (formerly Actualizers)\\n\\nInnovators are successful, sophisticated, take-charge people with high self-esteem. Because they have such abundant resources, they exhibit all three primary motivations in varying degrees. They are change leaders and are the most receptive to new ideas and technologies. Innovators are very active consumers, and their purchases reflect cultivated tastes for upscale, niche products and services.\\n\\nImage is important to Innovators, not as evidence of status or power but as an expression of their taste, independence, and personality. Innovators are among the established and emerging leaders in business and government, yet they continue to seek challenges. Their lives are characterized by variety. Their possessions and recreation reflect a cultivated taste for the finer things in life.\\n\\nThinkers (formerly Fulfilleds)\\n\\nThinkers are motivated by ideals. They are mature, satisfied, comfortable , and reflective people who value order, knowledge, and responsibility. They tend to be well educated and actively seek out information in the decision-making process. They are well-informed about world and national events and are alert to opportunities to broaden their knowledge.\\n\\nThinkers have a moderate respect for the status quo institutions of authority and social decorum, but are open to consider new ideas. Although their incomes allow them many choices, Thinkers are conservative, practical consumers; they look for durability, functionality, and value in the products they buy.\\n\\nAchievers\\n\\nMotivated by the desire for achievement, Achievers have goal-oriented lifestyles and a deep commitment to career and family. Their social lives reflect this focus and are structured around family, their place of worship, and work. Achievers live conventional lives, are politically conservative, and respect authority and the status quo. They value consensus, predictability, and stability over risk, intimacy, and self-discovery.\\n\\nWith many wants and needs, Achievers are active in the consumer marketplace. Image is important to Achievers; they favor established, prestige products and services that demonstrate success to their peers. Because of their busy lives, they are often interested in a variety of time-saving devices.\\n\\nExperiencers\\n\\nExperiencers are motivated by self-expression. As young, enthusiastic, and impulsive consumers, Experiencers quickly become enthusiastic about new possibilities but are equally quick to cool. They seek variety and excitement, savoring the new, the offbeat, and the risky. Their energy finds an outlet in exercise, sports, outdoor recreation, and social activities.\\n\\nExperiencers are avid consumers and spend a comparatively high proportion of their income on fashion, entertainment, and socializing. Their purchases reflect the emphasis they place on looking good and having \\\"cool\\\" stuff.\\n\\nBelievers\\n\\nLike Thinkers, Believers are motivated by ideals. They are conservative, conventional people with concrete beliefs based on traditional, established codes: family, religion, community, and the nation. Many Believers express moral codes that are deeply rooted and literally interpreted. They follow established routines, organized in large part around home, family, community, and social or religious organizations to which they belong.\\n\\nAs consumers, Believers are predictable; they choose familiar products and established brands. They favor America products and are generally loyal customers.\\n\\nO Welcome to VALS™\\no The VALS™ Types\\no More about VALS™\\no Program Brochures\\no VALS™ Survey\\no Survey Help / VALS™ FAQ\\no Publications\\n \\nStrivers\\n\\nStrivers are trendy and fun loving. Because they are motivated by achievement, Strivers are concerned about the opinions and approval of others. Money defines success for Strivers, who don't have enough of it to meet their desires. They favor stylish products that emulate the purchases of people with greater material wealth. Many see themselves as having a job rather than a career, and a lack of skills and focus often prevents them from moving ahead.\\n\\nStrivers are active consumers because shopping is both a social activity and an opportunity to demonstrate to peers their ability to buy. As consumers, they are as impulsive as their financial circumstance will allow.\\n\\nMakers\\n\\nLike Experiencers, Makers are motivated by self-expression. They express themselves and experience the world by working on it-building a house, raising children, fixing a car, or canning vegetables-and have enough skill and energy to carry out their projects successfully. Makers are practical people who have constructive skills and value self-sufficiency. They live within a traditional context of family, practical work, and physical recreation and have little interest in what lies outside that context.\\n\\nMakers are suspicious of new ideas and large institutions such as big business. They are respectful of government authority and organized labor, but resentful of government intrusion on individual rights. They are unimpressed by material possessions other than those with a practical or functional purpose. Because they prefer value to luxury, they buy basic products.\\n\\nSurvivors   (formerly Strugglers)\\n\\nSurvivors live narrowly focused lives. With few resources with which to cope, they often believe that the world is changing too quickly. They are comfortable with the familiar and are primarily concerned with safety and security. Because they must focus on meeting needs rather than fulfilling desires, Survivors do not show a strong primary motivation.\\n\\nSurvivors are cautious consumers. They represent a very modest market for most products and services. They are loyal to favorite brands, especially if they can purchase them at a discount.\\n\\nHttp://www.sric-bi.com/VALS/\",\"primaryKey\":[\"PartyId\",\"LifestyleGroupId\",\"PeriodStartDate\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PartyId\"},\"dataType\":\"long\",\"description\":\"The unique identifier of a Party.\",\"isNullable\":false,\"name\":\"PartyId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"LifestyleGroupId\"},\"dataType\":\"integer\",\"description\":\"The unique identifier of a Lifestyle Group.\",\"isNullable\":false,\"name\":\"LifestyleGroupId\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PeriodStartDate\"},\"dataType\":\"date\",\"dateFormat\":\"YYYY-MM-DD\",\"description\":\"The period start date for which the associated data is effective or 'as-of'.\",\"isNullable\":false,\"name\":\"PeriodStartDate\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PeriodEndDate\"},\"dataType\":\"date\",\"dateFormat\":\"YYYY-MM-DD\",\"description\":\"The period end date for which the associated data is effective or 'as-of'.\",\"isNullable\":true,\"name\":\"PeriodEndDate\"},{\"type\":\"Existing\",\"attributeReference\":{\"entity\":\"PartyLifestyleGroup.cdm.json/PartyLifestyleGroup\",\"name\":\"PartyLifestyleGroupNote\"},\"dataType\":\"string\",\"dataTypeLength\":2048,\"description\":\"A note, comment or additional information regarding the Party Lifestyle Group relationship.\",\"isNullable\":true,\"name\":\"PartyLifestyleGroupNote\"}]}}}",
			"Description": "The Party Lifestyle Group characteristic.\n\nThese criteria can change over a period of time and are represented with 'period start date/period end date' qualifications, which represented the best case for knowing this information.    If the data is only randomly sampled or recorded then you could use a single 'date' to identify its recording or effective as-of date.\n\nA classification of American consumers created by SRI International.\n\nThis classification defines nine lifestyle groups describing general personality traits and patterns of living.\n\n\"VALS is a marketing and consulting tool that helps businesses worldwide develop and execute more effective strategies. The system identifies current and future opportunities by segmenting the consumer marketplace on the basis of the personality traits that drive consumer behavior. VALS applies in all phases of the marketing process, from new-product development and entry-stage targeting to communications strategy and advertising.    The basic tenet of VALS is that people express their personalities through their behaviors. VALS specifically defines consumer segments on the basis of those personality traits that affect behavior in the marketplace. Rather than looking at what people do and segregating people with like activities, VALS uses psychology to segment people according to their distinct personality traits. The personality traits are the motivation-the cause. Buying behavior becomes the effect-the observable, external behavior prompted by an internal driver.\n\nAbout VALS™\n\nVALS reflects a real-world pattern that explains the relationship between personality traits and consumer behavior. VALS uses psychology to analyze the dynamics underlying consumer preferences and choices. VALS not only distinguishes differences in motivation, it also captures the psychological and material constraints on consumer behavior.\n\nVALS is based on current personality research into specific components of social behavior. VALS asserts that people express their personalities through their behaviors. People with different personalities engage in different behaviors or exhibit similar behaviors for different reasons\n\nHistory\n\nThe original VALS system was built by consumer futurist Arnold Mitchell. Mitchell created VALS to explain changing U.S. values and lifestyles in the 1970s. VALS was formally inaugurated as an SRI International product in 1978 and was cited by Advertising Age as \"one of the ten top market research breakthroughs of the 1980s.\"\n\nIn 1989, VALS was redefined to maximize its ability to predict consumer behavior. A team of experts from SRI International, Stanford University, and the University of California, Berkeley, determined that consumers should be segmented on the basis of enduring personality traits rather than social values that change over time.\n\nBy using psychology to analyze and predict consumer preferences and choices, the current VALS system creates an explicit link between personality traits and purchase behavior..\n\nYour VALS™ Type in Context\n\nEach of us is an individual. Yet each of us also has personality traits, attitudes, or needs that are similar to those of other people. VALS™ measures the underlying psychological motivations and resources that many consumers share that predict each group's typical choices as consumers. On this basis, we present you with information about your VALS type.\n\nYou may find that some of the details in your VALS description are not like you at all. But don't judge too quickly. The details that are literally unlike you may identify a basic tendency that you express in some other way. Your VALS type implies that you will share many attributes with others of the same type. It does not imply that you will resemble them in all your behavior. The description that we provide you should form an overall portrait that, as a whole, reflects you as an individual fairly well.\n\nPrimary Motivation\nConsumers buy products and services and seek experiences that fulfill their characteristic preferences and give shape, substance, and satisfaction to their lives. An individual's primary motivation determines what in particular about the self or the world is the meaningful core that governs his or her activities. Consumers are inspired by one of three primary motivations: ideals, achievement, and self-expression. Consumers who are primarily motivated by ideals are guided by knowledge and principles. Consumers who are primarily motivated by achievement look for products and services that demonstrate success to their peers. Consumers who are primarily motivated by self-expression desire social or physical activity, variety, and risk.\n\nResources\nA person's tendency to consume goods and services extends beyond age, income, and education. Energy, self-confidence, intellectualism, novelty seeking, innovativeness, impulsiveness, leadership, and vanity play a critical role. These personality traits in conjunction with key demographics determine an individual's resources. Different levels of resources enhance or constrain a person's expression of his or her primary motivation.\n\nVALS links global strategies to local efforts through GeoVALS.\n\nPenetrate beneath superficial geodemographic similarities.\n\nGeoVALS applies the power of VALS to local marketing initiatives by identifying the concentration of the VALS consumer groups residing within a specific block group or ZIP code. GeoVALS provides the flexibility to manipulate data by block group, ZIP code, post office, county, state, DMA, or customized aggregates of ZIP codes.\n\nUse GeoVALS for:\n \n \n-  Direct Marketing\nIncrease hit rates by identifying those ZIP codes with the highest proportion of your target.\n\n-  Sales Analysis\nEstimate the sales potential and analyze sales performance by region.\n\n-  Site Location\nSelect locations for retail outlets based on concentrations of target customers.\n\n-  Merchandise Mix\nCritique and refine merchandise mix based on the consumers within a trading area.\n\n-  Media Analysis\nTailor programming format and content to audience composition.\n\nVALS - Applications\n\nCommercialization\n\nVALS - facilitates successful product launches and helps avoid costly mistakes. Understanding the needs of different consumer groups guides new product and services development.\n \n-  Ideation\nBrainstorm new product ideas, business models, and future scenarios.\n\n-  Entry-Stage Targeting\nIdentify if a market exists for a product or service, then size the market.\n\n-  Concept Testing\nValidate the potential of new ideas among people most likely to buy.\n\n-  Focus Groups\nRecruit focus groups based on people with like motivations to capture clearer insight.\n\n-  Features and Benefits\n\nDesign features and benefits to appeal to innovators and early adopters.\n\n-  Business Partnerships\nEvaluate which business partners will prove to be the best match.\n\n-  Distribution Channel\nSelect the most appropriate distribution channels or retail outlets.\n\nPositioning\n\nVALS identifies which market opportunities are strongest. Relating features and benefits to distinct segment needs clarifies strategies for targeting and expansion.\n \n-  Competitive Analysis\nLocate core customers and competitors.\n\n-  Brand Differentiation\nUnderstand the motivation behind a purchase decision to ascertain key points of differentiation among brands.\n\n-  Customer Retention\nEvaluate the relative opportunity between current and potential customers and design effective retention strategies for core customers.\n\n-  Proprietary Research\nInclude the VALS survey in proprietary research studies to magnify learning.\n\n-  Bridge Data Sets\nCreate a bridge to other research studies that have included VALS.\n\n-  Product Life Cycle\nTrack and manage brand profitability by including VALS in ongoing studies.\n\nCommunications\n\nVALS shows you how to craft more effective messaging campaigns. Understanding what motivates consumers illuminates how to speak to them in ways that will initiate action.\n\n-  Selling Proposition\nDefine more compelling selling propositions linked to enduring motivations.\n\n-  Brand Personality\nNurture an attractive brand personality by understanding consumer preferences.\n\n-  Creative Development\nUse language and images that resonate with each segment.\n\n-  Message Placement\nEvaluate opportunities for message placement \n\n-  Media Preferences\nSelect media with larger audiences of the desired target.\n\"\n\nThis classification suggests that consumers move through the various groups in different stages of their lives.  Each stage affects the individual's attitudes, behavior and psychological needs.\n\nSRI International provides lifestyle group data to subscribers, which can then be used to formulate product and marketing strategies.\n\nVALS - short for values and lifestyles - is a way of viewing people on the basis of their attitudes, needs, wants, beliefs, and demographics. The VALS program was created by SRI International in 1978 in an attempt to \"put people\" into the thinking of those of us trying to understand the trends of our times - in the marketplace, economically, politically, sociologically, and humanly. The approach is holistic, drawing on insight and many sources of data to develop a comprehensive framework for characterizing the ways of life of Americans. \n\nA basic tool of the VALS program is the VALS typology. \n\nThis typology is divided into four major categories, with a total of eight types:\n\n- Innovators\n- Thinkers\n- Achievers\n- Experiencers\n- Believers\n- Strivers\n- Makers\n- Survivors\n\nInnovators (formerly Actualizers)\n\nInnovators are successful, sophisticated, take-charge people with high self-esteem. Because they have such abundant resources, they exhibit all three primary motivations in varying degrees. They are change leaders and are the most receptive to new ideas and technologies. Innovators are very active consumers, and their purchases reflect cultivated tastes for upscale, niche products and services.\n\nImage is important to Innovators, not as evidence of status or power but as an expression of their taste, independence, and personality. Innovators are among the established and emerging leaders in business and government, yet they continue to seek challenges. Their lives are characterized by variety. Their possessions and recreation reflect a cultivated taste for the finer things in life.\n\nThinkers (formerly Fulfilleds)\n\nThinkers are motivated by ideals. They are mature, satisfied, comfortable , and reflective people who value order, knowledge, and responsibility. They tend to be well educated and actively seek out information in the decision-making process. They are well-informed about world and national events and are alert to opportunities to broaden their knowledge.\n\nThinkers have a moderate respect for the status quo institutions of authority and social decorum, but are open to consider new ideas. Although their incomes allow them many choices, Thinkers are conservative, practical consumers; they look for durability, functionality, and value in the products they buy.\n\nAchievers\n\nMotivated by the desire for achievement, Achievers have goal-oriented lifestyles and a deep commitment to career and family. Their social lives reflect this focus and are structured around family, their place of worship, and work. Achievers live conventional lives, are politically conservative, and respect authority and the status quo. They value consensus, predictability, and stability over risk, intimacy, and self-discovery.\n\nWith many wants and needs, Achievers are active in the consumer marketplace. Image is important to Achievers; they favor established, prestige products and services that demonstrate success to their peers. Because of their busy lives, they are often interested in a variety of time-saving devices.\n\nExperiencers\n\nExperiencers are motivated by self-expression. As young, enthusiastic, and impulsive consumers, Experiencers quickly become enthusiastic about new possibilities but are equally quick to cool. They seek variety and excitement, savoring the new, the offbeat, and the risky. Their energy finds an outlet in exercise, sports, outdoor recreation, and social activities.\n\nExperiencers are avid consumers and spend a comparatively high proportion of their income on fashion, entertainment, and socializing. Their purchases reflect the emphasis they place on looking good and having \"cool\" stuff.\n\nBelievers\n\nLike Thinkers, Believers are motivated by ideals. They are conservative, conventional people with concrete beliefs based on traditional, established codes: family, religion, community, and the nation. Many Believers express moral codes that are deeply rooted and literally interpreted. They follow established routines, organized in large part around home, family, community, and social or religious organizations to which they belong.\n\nAs consumers, Believers are predictable; they choose familiar products and established brands. They favor America products and are generally loyal customers.\n\nO Welcome to VALS™\no The VALS™ Types\no More about VALS™\no Program Brochures\no VALS™ Survey\no Survey Help / VALS™ FAQ\no Publications\n \nStrivers\n\nStrivers are trendy and fun loving. Because they are motivated by achievement, Strivers are concerned about the opinions and approval of others. Money defines success for Strivers, who don't have enough of it to meet their desires. They favor stylish products that emulate the purchases of people with greater material wealth. Many see themselves as having a job rather than a career, and a lack of skills and focus often prevents them from moving ahead.\n\nStrivers are active consumers because shopping is both a social activity and an opportunity to demonstrate to peers their ability to buy. As consumers, they are as impulsive as their financial circumstance will allow.\n\nMakers\n\nLike Experiencers, Makers are motivated by self-expression. They express themselves and experience the world by working on it-building a house, raising children, fixing a car, or canning vegetables-and have enough skill and energy to carry out their projects successfully. Makers are practical people who have constructive skills and value self-sufficiency. They live within a traditional context of family, practical work, and physical recreation and have little interest in what lies outside that context.\n\nMakers are suspicious of new ideas and large institutions such as big business. They are respectful of government authority and organized labor, but resentful of government intrusion on individual rights. They are unimpressed by material possessions other than those with a practical or functional purpose. Because they prefer value to luxury, they buy basic products.\n\nSurvivors   (formerly Strugglers)\n\nSurvivors live narrowly focused lives. With few resources with which to cope, they often believe that the world is changing too quickly. They are comfortable with the familiar and are primarily concerned with safety and security. Because they must focus on meeting needs rather than fulfilling desires, Survivors do not show a strong primary motivation.\n\nSurvivors are cautious consumers. They represent a very modest market for most products and services. They are loyal to favorite brands, especially if they can purchase them at a discount.\n\nHttp://www.sric-bi.com/VALS/",
			"DisplayFolderInfo": "{\"name\":\"Party\",\"colorCode\":\"#7D0F6C\"}",
			"PrimaryKeys": "PartyId,LifestyleGroupId,PeriodStartDate",
			"spark.sql.sources.provider": "csv",
			"x-ms-usageinfo": "AzureSynapseDatabaseTemplate",
			"spark.sql.sources.schema.numParts": "1",
			"spark.sql.sources.schema.part.0": "{\"type\":\"struct\",\"fields\":[{\"name\":\"PartyId\",\"type\":\"long\",\"nullable\":false,\"metadata\":{}},{\"name\":\"LifestyleGroupId\",\"type\":\"integer\",\"nullable\":false,\"metadata\":{}},{\"name\":\"PeriodStartDate\",\"type\":\"date\",\"nullable\":false,\"metadata\":{}},{\"name\":\"PeriodEndDate\",\"type\":\"date\",\"nullable\":true,\"metadata\":{}},{\"name\":\"PartyLifestyleGroupNote\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}}]}"
		},
		"ObjectVersion": 1,
		"ObjectId": "81760f38-7ae0-4aac-9509-5e56bd9999fb",
		"Description": "The Party Lifestyle Group characteristic.\n\nThese criteria can change over a period of time and are represented with 'period start date/period end date' qualifications, which represented the best case for knowing this information.    If the data is only randomly sampled or recorded then you could use a single 'date' to identify its recording or effective as-of date.\n\nA classification of American consumers created by SRI International.\n\nThis classification defines nine lifestyle groups describing general personality traits and patterns of living.\n\n\"VALS is a marketing and consulting tool that helps businesses worldwide develop and execute more effective strategies. The system identifies current and future opportunities by segmenting the consumer marketplace on the basis of the personality traits that drive consumer behavior. VALS applies in all phases of the marketing process, from new-product development and entry-stage targeting to communications strategy and advertising.    The basic tenet of VALS is that people express their personalities through their behaviors. VALS specifically defines consumer segments on the basis of those personality traits that affect behavior in the marketplace. Rather than looking at what people do and segregating people with like activities, VALS uses psychology to segment people according to their distinct personality traits. The personality traits are the motivation-the cause. Buying behavior becomes the effect-the observable, external behavior prompted by an internal driver.\n\nAbout VALS™\n\nVALS reflects a real-world pattern that explains the relationship between personality traits and consumer behavior. VALS uses psychology to analyze the dynamics underlying consumer preferences and choices. VALS not only distinguishes differences in motivation, it also captures the psychological and material constraints on consumer behavior.\n\nVALS is based on current personality research into specific components of social behavior. VALS asserts that people express their personalities through their behaviors. People with different personalities engage in different behaviors or exhibit similar behaviors for different reasons\n\nHistory\n\nThe original VALS system was built by consumer futurist Arnold Mitchell. Mitchell created VALS to explain changing U.S. values and lifestyles in the 1970s. VALS was formally inaugurated as an SRI International product in 1978 and was cited by Advertising Age as \"one of the ten top market research breakthroughs of the 1980s.\"\n\nIn 1989, VALS was redefined to maximize its ability to predict consumer behavior. A team of experts from SRI International, Stanford University, and the University of California, Berkeley, determined that consumers should be segmented on the basis of enduring personality traits rather than social values that change over time.\n\nBy using psychology to analyze and predict consumer preferences and choices, the current VALS system creates an explicit link between personality traits and purchase behavior..\n\nYour VALS™ Type in Context\n\nEach of us is an individual. Yet each of us also has personality traits, attitudes, or needs that are similar to those of other people. VALS™ measures the underlying psychological motivations and resources that many consumers share that predict each group's typical choices as consumers. On this basis, we present you with information about your VALS type.\n\nYou may find that some of the details in your VALS description are not like you at all. But don't judge too quickly. The details that are literally unlike you may identify a basic tendency that you express in some other way. Your VALS type implies that you will share many attributes with others of the same type. It does not imply that you will resemble them in all your behavior. The description that we provide you should form an overall portrait that, as a whole, reflects you as an individual fairly well.\n\nPrimary Motivation\nConsumers buy products and services and seek experiences that fulfill their characteristic preferences and give shape, substance, and satisfaction to their lives. An individual's primary motivation determines what in particular about the self or the world is the meaningful core that governs his or her activities. Consumers are inspired by one of three primary motivations: ideals, achievement, and self-expression. Consumers who are primarily motivated by ideals are guided by knowledge and principles. Consumers who are primarily motivated by achievement look for products and services that demonstrate success to their peers. Consumers who are primarily motivated by self-expression desire social or physical activity, variety, and risk.\n\nResources\nA person's tendency to consume goods and services extends beyond age, income, and education. Energy, self-confidence, intellectualism, novelty seeking, innovativeness, impulsiveness, leadership, and vanity play a critical role. These personality traits in conjunction with key demographics determine an individual's resources. Different levels of resources enhance or constrain a person's expression of his or her primary motivation.\n\nVALS links global strategies to local efforts through GeoVALS.\n\nPenetrate beneath superficial geodemographic similarities.\n\nGeoVALS applies the power of VALS to local marketing initiatives by identifying the concentration of the VALS consumer groups residing within a specific block group or ZIP code. GeoVALS provides the flexibility to manipulate data by block group, ZIP code, post office, county, state, DMA, or customized aggregates of ZIP codes.\n\nUse GeoVALS for:\n \n \n-  Direct Marketing\nIncrease hit rates by identifying those ZIP codes with the highest proportion of your target.\n\n-  Sales Analysis\nEstimate the sales potential and analyze sales performance by region.\n\n-  Site Location\nSelect locations for retail outlets based on concentrations of target customers.\n\n-  Merchandise Mix\nCritique and refine merchandise mix based on the consumers within a trading area.\n\n-  Media Analysis\nTailor programming format and content to audience composition.\n\nVALS - Applications\n\nCommercialization\n\nVALS - facilitates successful product launches and helps avoid costly mistakes. Understanding the needs of different consumer groups guides new product and services development.\n \n-  Ideation\nBrainstorm new product ideas, business models, and future scenarios.\n\n-  Entry-Stage Targeting\nIdentify if a market exists for a product or service, then size the market.\n\n-  Concept Testing\nValidate the potential of new ideas among people most likely to buy.\n\n-  Focus Groups\nRecruit focus groups based on people with like motivations to capture clearer insight.\n\n-  Features and Benefits\n\nDesign features and benefits to appeal to innovators and early adopters.\n\n-  Business Partnerships\nEvaluate which business partners will prove to be the best match.\n\n-  Distribution Channel\nSelect the most appropriate distribution channels or retail outlets.\n\nPositioning\n\nVALS identifies which market opportunities are strongest. Relating features and benefits to distinct segment needs clarifies strategies for targeting and expansion.\n \n-  Competitive Analysis\nLocate core customers and competitors.\n\n-  Brand Differentiation\nUnderstand the motivation behind a purchase decision to ascertain key points of differentiation among brands.\n\n-  Customer Retention\nEvaluate the relative opportunity between current and potential customers and design effective retention strategies for core customers.\n\n-  Proprietary Research\nInclude the VALS survey in proprietary research studies to magnify learning.\n\n-  Bridge Data Sets\nCreate a bridge to other research studies that have included VALS.\n\n-  Product Life Cycle\nTrack and manage brand profitability by including VALS in ongoing studies.\n\nCommunications\n\nVALS shows you how to craft more effective messaging campaigns. Understanding what motivates consumers illuminates how to speak to them in ways that will initiate action.\n\n-  Selling Proposition\nDefine more compelling selling propositions linked to enduring motivations.\n\n-  Brand Personality\nNurture an attractive brand personality by understanding consumer preferences.\n\n-  Creative Development\nUse language and images that resonate with each segment.\n\n-  Message Placement\nEvaluate opportunities for message placement \n\n-  Media Preferences\nSelect media with larger audiences of the desired target.\n\"\n\nThis classification suggests that consumers move through the various groups in different stages of their lives.  Each stage affects the individual's attitudes, behavior and psychological needs.\n\nSRI International provides lifestyle group data to subscribers, which can then be used to formulate product and marketing strategies.\n\nVALS - short for values and lifestyles - is a way of viewing people on the basis of their attitudes, needs, wants, beliefs, and demographics. The VALS program was created by SRI International in 1978 in an attempt to \"put people\" into the thinking of those of us trying to understand the trends of our times - in the marketplace, economically, politically, sociologically, and humanly. The approach is holistic, drawing on insight and many sources of data to develop a comprehensive framework for characterizing the ways of life of Americans. \n\nA basic tool of the VALS program is the VALS typology. \n\nThis typology is divided into four major categories, with a total of eight types:\n\n- Innovators\n- Thinkers\n- Achievers\n- Experiencers\n- Believers\n- Strivers\n- Makers\n- Survivors\n\nInnovators (formerly Actualizers)\n\nInnovators are successful, sophisticated, take-charge people with high self-esteem. Because they have such abundant resources, they exhibit all three primary motivations in varying degrees. They are change leaders and are the most receptive to new ideas and technologies. Innovators are very active consumers, and their purchases reflect cultivated tastes for upscale, niche products and services.\n\nImage is important to Innovators, not as evidence of status or power but as an expression of their taste, independence, and personality. Innovators are among the established and emerging leaders in business and government, yet they continue to seek challenges. Their lives are characterized by variety. Their possessions and recreation reflect a cultivated taste for the finer things in life.\n\nThinkers (formerly Fulfilleds)\n\nThinkers are motivated by ideals. They are mature, satisfied, comfortable , and reflective people who value order, knowledge, and responsibility. They tend to be well educated and actively seek out information in the decision-making process. They are well-informed about world and national events and are alert to opportunities to broaden their knowledge.\n\nThinkers have a moderate respect for the status quo institutions of authority and social decorum, but are open to consider new ideas. Although their incomes allow them many choices, Thinkers are conservative, practical consumers; they look for durability, functionality, and value in the products they buy.\n\nAchievers\n\nMotivated by the desire for achievement, Achievers have goal-oriented lifestyles and a deep commitment to career and family. Their social lives reflect this focus and are structured around family, their place of worship, and work. Achievers live conventional lives, are politically conservative, and respect authority and the status quo. They value consensus, predictability, and stability over risk, intimacy, and self-discovery.\n\nWith many wants and needs, Achievers are active in the consumer marketplace. Image is important to Achievers; they favor established, prestige products and services that demonstrate success to their peers. Because of their busy lives, they are often interested in a variety of time-saving devices.\n\nExperiencers\n\nExperiencers are motivated by self-expression. As young, enthusiastic, and impulsive consumers, Experiencers quickly become enthusiastic about new possibilities but are equally quick to cool. They seek variety and excitement, savoring the new, the offbeat, and the risky. Their energy finds an outlet in exercise, sports, outdoor recreation, and social activities.\n\nExperiencers are avid consumers and spend a comparatively high proportion of their income on fashion, entertainment, and socializing. Their purchases reflect the emphasis they place on looking good and having \"cool\" stuff.\n\nBelievers\n\nLike Thinkers, Believers are motivated by ideals. They are conservative, conventional people with concrete beliefs based on traditional, established codes: family, religion, community, and the nation. Many Believers express moral codes that are deeply rooted and literally interpreted. They follow established routines, organized in large part around home, family, community, and social or religious organizations to which they belong.\n\nAs consumers, Believers are predictable; they choose familiar products and established brands. They favor America products and are generally loyal customers.\n\nO Welcome to VALS™\no The VALS™ Types\no More about VALS™\no Program Brochures\no VALS™ Survey\no Survey Help / VALS™ FAQ\no Publications\n \nStrivers\n\nStrivers are trendy and fun loving. Because they are motivated by achievement, Strivers are concerned about the opinions and approval of others. Money defines success for Strivers, who don't have enough of it to meet their desires. They favor stylish products that emulate the purchases of people with greater material wealth. Many see themselves as having a job rather than a career, and a lack of skills and focus often prevents them from moving ahead.\n\nStrivers are active consumers because shopping is both a social activity and an opportunity to demonstrate to peers their ability to buy. As consumers, they are as impulsive as their financial circumstance will allow.\n\nMakers\n\nLike Experiencers, Makers are motivated by self-expression. They express themselves and experience the world by working on it-building a house, raising children, fixing a car, or canning vegetables-and have enough skill and energy to carry out their projects successfully. Makers are practical people who have constructive skills and value self-sufficiency. They live within a traditional context of family, practical work, and physical recreation and have little interest in what lies outside that context.\n\nMakers are suspicious of new ideas and large institutions such as big business. They are respectful of government authority and organized labor, but resentful of government intrusion on individual rights. They are unimpressed by material possessions other than those with a practical or functional purpose. Because they prefer value to luxury, they buy basic products.\n\nSurvivors   (formerly Strugglers)\n\nSurvivors live narrowly focused lives. With few resources with which to cope, they often believe that the world is changing too quickly. They are comfortable with the familiar and are primarily concerned with safety and security. Because they must focus on meeting needs rather than fulfilling desires, Survivors do not show a strong primary motivation.\n\nSurvivors are cautious consumers. They represent a very modest market for most products and services. They are loyal to favorite brands, especially if they can purchase them at a discount.\n\nHttp://www.sric-bi.com/VALS/"
	},
	"type": "TABLE"
}